doc.org
#+STARTUP: latexpreview
#+TITLE: SMC RESEARCH PROJECT 2013-2014: Evaluation of Pitch-Class Set Similarity Measures for Tonal Analysis
#+AUTHOR: NICHOLAS HARLEY

