doc.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>SMC RESEARCH PROJECT 2013-2014: Evaluation of Pitch-Class Set Similarity Measures for Tonal Analysis</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="SMC RESEARCH PROJECT 2013-2014: Evaluation of Pitch-Class Set Similarity Measures for Tonal Analysis"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-01-30T09:55+0100"/>
<meta name="author" content="NICHOLAS HARLEY"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">SMC RESEARCH PROJECT 2013-2014: Evaluation of Pitch-Class Set Similarity Measures for Tonal Analysis</h1>
