doc.org
* Theoretical Resemblace Models				 :SimilarityMeasures:
** REL								      :Lewin:
FROM: [[Lewin,%201979][Lewin]]
*** Description
    - For each class being compare the subset vector is computed
    - the subset vector is 357 dimensions
      - 6 for IcV then 351 for each correspondin to the embedding all  Tn related sets
    - sub(X,i) is the ith term in the subset vector
*** Formula
     $$ REL ( A,B ) = \frac{\sum_{i=1}^{357}\sqrt{sub(A,i).sub(B,i)} }{\sqrt{\sum_{i=1}^{357}sub(A,i).\sum_{i=1}^{357}sub(B,i)}} $$
** REL2								      :Lewin:
FROM: [[Lewin,%201979-80][Lewin]], 1979-80
*** Description
    - A specialised version of [[REL]] that measures only intervallic similarity
    - criticises Rahns (x_{i}+y_{i}) as "arithmetic awkwardness"
    - Multiplies corresponding IcV entries
    - REL2 increases as corresponding IcV entries increase
    - As cardinality increases, range of REL decreases
    - high level of distinction
    - produces max similarity only when IcVs are identical
*** Formula
    $$ REL_{2}(X,Y) \frac{2\times \sum \sqrt{(x_{i}y_{i})}}{\sqrt(\#X(\#X-1)\#Y(\#Y-1))} $$
** EMB								      :Lewin:
*** Description
    - EMB(A,X) is the number of pitch-class sets in set-class A which are subsets of a given pitch-class set in set-class X.

** IcVSIM							   :Isaacson:
From: [[Isaacson,%201990][Isaacson, 1990]]
*** Description
    - the standard deviation of the entries in the [[IdV]] of two sets
    - Same degree of distinction as [[Teitelbaum,%201965][s.i.]]
    - any cardinality
    - Mathematically IcVSIM is a scalled version of s.i.
*** Formula
    $$ IcVSIM\left(X,Y\right)=\sigma\left(IdV\right) $$
    where 
    $$ IdV=[(y_{1}-x_{1})(y_{2}-x_{2})...(y_{6}-x_{6})] $$
    and
    $$ \sigma =  \sqrt {\frac {\sum (IdV_{i}- \overline {IdV})^{2}}{6}} $$
    where
    $$IdV_{i}$$ is the ith term of the interval-difference vector and
    $$\overline {IdV}$$ is the average (mean) of the terms in the IdV
** ISIM2							   :Isaacson:
FROM: [[Isaacson,%201996][Isaacson]]
*** Description
    - IcV entries are scaled by taking the square root
    - otherwise its the same as [[IcVSIM]]
    - [[Samplaski,%202005][Samplaski]] found ISIM2 to be inconsistent with itself with [[MDS]]
** s.i.								 :Teitelbaum:
*** Description
    - Greater discrimincation than Forte, Morris, Lord
    - same cardinality
    - vlaues approach 0 when the pcsets being compared are in a close intervallic relationship
    - high level of distinction (almost as high as [[Lewin,%201979-80][Lewin]]'s [[REL2]])
    - can compare the intervallic similarity of sets with the same cardinality to a reference
    - evaluable to some degree by MDS, but not very attractive
*** Formula
    $$  s.i.(X,Y) = \sqrt{\sum (x_{i}-y_{i})^{2}} $$
** R-relations							      :Forte:
   - Rn
   - Same cardinality
   - not a complete system (many IcV pairs have no Rn relation
   - See [[Isaacson,%201990][Isaacson]] for criticism
** SIM								     :Morris:
   From: [[Morris,%201979][Morris]]
*** Description

    - sum of the absolute values of the differences between corresponding IcV entries for the sets
    - Produces 15 unique values:
     - four each for trichords and tetrachords
     - three each for pentachords and hexachords

*** Formula
    $$ SIM \left ( X, Y \right ) = \sum_{i = 1}^{6} \left | x_{i} - y_{i} \right | $$   
** ASIM								     :Morris:
   From: [[Morris,%201979][Morris]]
