doc.html

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Theoretical Resemblace Models &nbsp;&nbsp;&nbsp;<span class="tag"><span class="SimilarityMeasures">SimilarityMeasures</span></span></h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> REL &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Lewin">Lewin</span></span></h3>
<div class="outline-text-3" id="text-2-1">

<p>FROM: <a href="#Lewin-1979">Lewin</a>
</p>
</div>

<div id="outline-container-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> Description</h4>
<div class="outline-text-4" id="text-2-1-1">

<ul>
<li>For each class being compare the subset vector is computed
</li>
<li>the subset vector is 357 dimensions
<ul>
<li>6 for IcV then 351 for each correspondin to the embedding all  Tn related sets
</li>
</ul>

</li>
<li>sub(X,i) is the ith term in the subset vector
</li>
</ul>

</div>

</div>

<div id="outline-container-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> Formula</h4>
<div class="outline-text-4" id="text-2-1-2">

<p>     $$ REL ( A,B ) = \frac{\sum_{i=1}^{357}\sqrt{sub(A,i).sub(B,i)} }{\sqrt{\sum_{i=1}^{357}sub(A,i).\sum_{i=1}^{357}sub(B,i)}} $$
</p></div>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> REL2 &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Lewin">Lewin</span></span></h3>
<div class="outline-text-3" id="text-2-2">

<p>FROM: <a href="#sec-9">Lewin</a>, 1979-80
</p>
</div>

<div id="outline-container-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> Description</h4>
<div class="outline-text-4" id="text-2-2-1">

<ul>
<li>A specialised version of <a href="#sec-2-1">REL</a> that measures only intervallic similarity
</li>
<li>criticises Rahns (x<sub>i</sub>+y<sub>i</sub>) as "arithmetic awkwardness"
</li>
<li>Multiplies corresponding IcV entries
</li>
<li>REL2 increases as corresponding IcV entries increase
</li>
<li>As cardinality increases, range of REL decreases
</li>
<li>high level of distinction
</li>
<li>produces max similarity only when IcVs are identical
</li>
</ul>

</div>

</div>

<div id="outline-container-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> Formula</h4>
<div class="outline-text-4" id="text-2-2-2">

<p>    $$ REL_{2}(X,Y) \frac{2\times \sum \sqrt{(x_{i}y_{i})}}{\sqrt(\#X(\#X-1)\#Y(\#Y-1))} $$
</p></div>
</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> EMB &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Lewin">Lewin</span></span></h3>
<div class="outline-text-3" id="text-2-3">


</div>

<div id="outline-container-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> Description</h4>
<div class="outline-text-4" id="text-2-3-1">

<ul>
<li>EMB(A,X) is the number of pitch-class sets in set-class A which are subsets of a given pitch-class set in set-class X.
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> IcVSIM &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Isaacson">Isaacson</span></span></h3>
<div class="outline-text-3" id="text-2-4">

<p>From: <a href="#sec-6">Isaacson, 1990</a>
</p>
</div>

<div id="outline-container-2-4-1" class="outline-4">
<h4 id="sec-2-4-1"><span class="section-number-4">2.4.1</span> Description</h4>
<div class="outline-text-4" id="text-2-4-1">

<ul>
<li>the standard deviation of the entries in the <a href="#sec-19-19">IdV</a> of two sets
</li>
<li>Same degree of distinction as <a href="#sec-12">s.i.</a>
</li>
<li>any cardinality
</li>
<li>Mathematically IcVSIM is a scalled version of s.i.
</li>
</ul>

</div>

</div>

<div id="outline-container-2-4-2" class="outline-4">
<h4 id="sec-2-4-2"><span class="section-number-4">2.4.2</span> Formula</h4>
<div class="outline-text-4" id="text-2-4-2">

<p>    $$ IcVSIM\left(X,Y\right)=\sigma\left(IdV\right) $$
    where 
    $$ IdV=[(y_{1}-x_{1})(y_{2}-x_{2})...(y_{6}-x_{6})] $$
    and
    $$ \sigma =  \sqrt {\frac {\sum (IdV_{i}- \overline {IdV})^{2}}{6}} $$
    where
    $$IdV_{i}$$ is the ith term of the interval-difference vector and
    $$\overline {IdV}$$ is the average (mean) of the terms in the IdV
</p></div>
</div>

</div>

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> ISIM2 &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Isaacson">Isaacson</span></span></h3>
<div class="outline-text-3" id="text-2-5">

<p>FROM: <a href="#sec-8">Isaacson</a>
</p>
</div>

<div id="outline-container-2-5-1" class="outline-4">
<h4 id="sec-2-5-1"><span class="section-number-4">2.5.1</span> Description</h4>
<div class="outline-text-4" id="text-2-5-1">

<ul>
<li>IcV entries are scaled by taking the square root
</li>
<li>otherwise its the same as <a href="#sec-2-4">IcVSIM</a>
</li>
<li><a href="#sec-13">Samplaski</a> found ISIM2 to be inconsistent with itself with <a href="#sec-20">MDS</a>
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> s.i. &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Teitelbaum">Teitelbaum</span></span></h3>
<div class="outline-text-3" id="text-2-6">


</div>

<div id="outline-container-2-6-1" class="outline-4">
<h4 id="sec-2-6-1"><span class="section-number-4">2.6.1</span> Description</h4>
<div class="outline-text-4" id="text-2-6-1">

<ul>
<li>Greater discrimincation than Forte, Morris, Lord
</li>
<li>same cardinality
</li>
<li>vlaues approach 0 when the pcsets being compared are in a close intervallic relationship
</li>
<li>high level of distinction (almost as high as <a href="#sec-9">Lewin</a>'s <a href="#sec-2-2">REL2</a>)
</li>
<li>can compare the intervallic similarity of sets with the same cardinality to a reference
</li>
<li>evaluable to some degree by MDS, but not very attractive
</li>
</ul>

</div>

</div>

<div id="outline-container-2-6-2" class="outline-4">
<h4 id="sec-2-6-2"><span class="section-number-4">2.6.2</span> Formula</h4>
<div class="outline-text-4" id="text-2-6-2">

<p>    $$  s.i.(X,Y) = \sqrt{\sum (x_{i}-y_{i})^{2}} $$
</p></div>
</div>

</div>

<div id="outline-container-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> R-relations &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Forte">Forte</span></span></h3>
<div class="outline-text-3" id="text-2-7">

<ul>
<li>Rn
</li>
<li>Same cardinality
</li>
<li>not a complete system (many IcV pairs have no Rn relation
</li>
<li>See <a href="#sec-6">Isaacson</a> for criticism
</li>
</ul>

</div>

</div>

<div id="outline-container-2-8" class="outline-3">
<h3 id="sec-2-8"><span class="section-number-3">2.8</span> SIM &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Morris">Morris</span></span></h3>
<div class="outline-text-3" id="text-2-8">

<p>   From: <a href="#sec-5">Morris</a>
</p>
</div>

<div id="outline-container-2-8-1" class="outline-4">
<h4 id="sec-2-8-1"><span class="section-number-4">2.8.1</span> Description</h4>
<div class="outline-text-4" id="text-2-8-1">


<ul>
<li>sum of the absolute values of the differences between corresponding IcV entries for the sets
</li>
<li>Produces 15 unique values:
<ul>
<li>four each for trichords and tetrachords
</li>
<li>three each for pentachords and hexachords
</li>
</ul>

</li>
</ul>


</div>

</div>
