doc.tex
\section{Theoretical Resemblace Models\hfill{}\textsc{SimilarityMeasures}}
\label{sec-3}
\subsection{REL\hfill{}\textsc{Lewin}}
\label{sec-3-1}
FROM: \texttt{Lewin}
\subsubsection{Description}
\label{sec-3-1-1}
\begin{itemize}
\item For each class being compare the subset vector is computed
\item the subset vector is 357 dimensions
\begin{itemize}
\item 6 for IcV then 351 for each correspondin to the embedding all
Tn related sets
\end{itemize}
\item sub(X,i) is the ith term in the subset vector
\end{itemize}

\subsubsection{Formula}
\label{sec-3-1-2}
$$ REL ( A,B ) = \frac{\sum_{i=1}^{357}\sqrt{sub(A,i).sub(B,i)} }{\sqrt{\sum_{i=1}^{357}sub(A,i).\sum_{i=1}^{357}sub(B,i)}} $$

\subsection{REL2\hfill{}\textsc{Lewin}}
\label{sec-3-2}
FROM: \texttt{Lewin}, 1979-80
\subsubsection{Description}
\label{sec-3-2-1}
\begin{itemize}
\item A specialised version of \ref{sec-3-1} that measures only intervallic
similarity
\item criticises Rahns (x$_{\text{i}}$+y$_{\text{i}}$) as "arithmetic awkwardness"
\item Multiplies corresponding IcV entries
\item REL2 increases as corresponding IcV entries increase
\item As cardinality increases, range of REL decreases
\item high level of distinction
\item produces max similarity only when IcVs are identical
\end{itemize}

\subsubsection{Formula}
\label{sec-3-2-2}
$$ REL_{2}(X,Y) \frac{2\times \sum \sqrt{(x_{i}y_{i})}}{\sqrt(\#X(\#X-1)\#Y(\#Y-1))} $$

\subsection{EMB\hfill{}\textsc{Lewin}}
\label{sec-3-3}
\subsubsection{Description}
\label{sec-3-3-1}
\begin{itemize}
\item EMB(A,X) is the number of pitch-class sets in set-class A which
are subsets of a given pitch-class set in set-class X.
\end{itemize}
\subsection{IcVSIM\hfill{}\textsc{Isaacson}}
\label{sec-3-4}
From: \texttt{Isaacson, 1990}
\subsubsection{Description}
\label{sec-3-4-1}
\begin{itemize}
\item the standard deviation of the entries in the \ref{sec-21-19} of two sets
\item Same degree of distinction as \texttt{s.i.}
\item any cardinality
\item Mathematically IcVSIM is a scalled version of s.i.
\end{itemize}

\subsubsection{Formula}
\label{sec-3-4-2}
$$ IcVSIM\left(X,Y\right)=\sigma\left(IdV\right) $$
where 
$$ IdV=[(y_{1}-x_{1})(y_{2}-x_{2})...(y_{6}-x_{6})] $$
and
$$ \sigma =  \sqrt {\frac {\sum (IdV_{i}- \overline {IdV})^{2}}{6}} $$
where
$$IdV_{i}$$ is the ith term of the interval-difference vector and
$$\overline {IdV}$$ is the average (mean) of the terms in the IdV

\subsection{ISIM2\hfill{}\textsc{Isaacson}}
\label{sec-3-5}
FROM: \texttt{Isaacson}
\subsubsection{Description}
\label{sec-3-5-1}
\begin{itemize}
\item IcV entries are scaled by taking the square root
\item otherwise its the same as \ref{sec-3-4}
\item \texttt{Samplaski} found ISIM2 to be inconsistent with itself with \ref{sec-22}
\end{itemize}

\subsection{s.i.\hfill{}\textsc{Teitelbaum}}
\label{sec-3-6}
\subsubsection{Description}
\label{sec-3-6-1}
\begin{itemize}
\item Greater discrimincation than Forte, Morris, Lord
\item same cardinality
\item vlaues approach 0 when the pcsets being compared are in a close
intervallic relationship
\item high level of distinction (almost as high as \texttt{Lewin}'s \ref{sec-3-2})
\item can compare the intervallic similarity of sets with the same
cardinality to a reference
\item evaluable to some degree by MDS, but not very attractive
\end{itemize}

\subsubsection{Formula}
\label{sec-3-6-2}
$$  s.i.(X,Y) = \sqrt{\sum (x_{i}-y_{i})^{2}} $$

\subsection{R-relations\hfill{}\textsc{Forte}}
\label{sec-3-7}
\begin{itemize}
\item Rn
\item Same cardinality
\item not a complete system (many IcV pairs have no Rn relation
\item See \texttt{Isaacson} for criticism
\end{itemize}

\subsection{SIM\hfill{}\textsc{Morris}}
\label{sec-3-8}
From: \texttt{Morris}
\subsubsection{Description}
\label{sec-3-8-1}

\begin{itemize}
\item sum of the absolute values of the differences between
corresponding IcV entries for the sets
\item Produces 15 unique values:
\begin{itemize}
\item four each for trichords and tetrachords
\item three each for pentachords and hexachords
\end{itemize}
\end{itemize}
