doc.org
*** Description
   - Any size/cardinality:
     - but there is "diminishing return" as the difference between the cardinalities of the two sets increases
     - values of SIM increase as the difference in cardinality between sets increases
     - ASIM(X,Y): values are weighted by dividing them by the sum of the cardinalities of the sets

*** Formula

    $$ ASIM \left ( X, Y \right ) = \frac{SIM \left ( X, Y \right )}{\left ( \# V \left (X \right ) + \# V \left (Y \right ) \right )} $$
** K								     :Morris:
From: [[Morris,%201979][Morris]]
*** Description

    - Number of ics in common between the sets X and Y
    - It is a function of SIM(X,Y)
    - Rahn prefers k to SIM

*** Formula
    
    $$ k = \frac{\left( \# V  \left( R \right) + \# V  \left( S \right) - SIM  \left( R, S \right) \right)}{2} $$
    Rahn writes it differently (as a funtion of X and Y)
    $$ k\left(X, Y \right) = \frac{\left( \# V  \left( R \right) + \# V  \left( S \right) - SIM  \left( R, S \right) \right)}{2} $$
** AK								       :Rahn:
   From: [[Rahn,%201979][Rahn]]
*** Description
    - absolute or adjusted [[K][k]] (from Morris, comparable to [[ASIM]])
    - ASIM and Ak are closeley relate
*** Fromula
    $$ ak \left( X, Y \right) = \frac{2 \times k \left( X, Y \right)}{\# V \left( X \right) + \# V \left( Y \right) }  $$
    $$ Ak(X,Y)=1-ASIM(X,Y) $$
** MEMB								       :Rahn:
FROM: [[Rahn,%201979][Rahn]]
*** Description
    - [[MEMBn]] counts number of subsets X of size n
    - a subset must be present in both X and Y before it is counted 
    - by setting n to 2 you get [[MEMB2]] (measure of ic similarity)
    - works badly when cardinalities differ greatly
*** Formula
**** MEMBn
     $$ MEMB_{n} \left( J,X,Y \right) = EMB \left( J,X \right) + EMB \left( J,Y \right)  $$
     for all J such that
     $$ \# J = n $$
     and
     $$ EMB \left( J,X \right) > 0 $$
     and 
     $$ EMB \left( J,Y \right) > 0 $$
     so...
     $$ MEMB_{\#X}\left( X,X,Y \right)=EMB\left( X,Y \right) + 1 $$

**** MEMB2
     $$ MEMB_{2}\left(X,Y\right)=\sum_{i=1}^{6}\left(x_{i}+y_{i}\right) $$
     such that $$ \left(x_{i}>0\right) $$ and $$ \left(y_{i}>0\right) $$
** AMEMB2							   :Isaacson:
From: [[Isaacson,%201990][Isaacson]]
*** Description
    - Isaacson describes a scaled version of [[MEMB2]]
    - Applies a normalisation factor equivelant to that used by [[Rahn,%201979][Rahn]] to derive [[ATMEMB]] from [[TMEMB]]
    - range of values decreases as cardinality increases
    - AMEMB increases as cardinality increases - troubling
*** Formula
    $$ AMEMB_{2}=\frac{\sum \left( x_{i}+y_{i} \right)}{\frac{\left(\#X\left(\#X-1\right)+\#Y\left(\#Y-1\right)\right)}{2}} $$
    such that $$ \left(x_{i}>0\right) $$ and $$ \left(y_{i}>0\right) $$
** TMEMB							       :Rahn:
From: [[Rahn,%201979][Rahn]]
*** Description
    - the sum of all [[MEMBn]] (n = 2 to 12)
    - distinguishes between Z-related sets
*** Formula
     $$ TMEMB \left( A,B \right) = \sum_{n=2}^{12}MEMB_{n}\left( X,A,B \right) $$
** ATMEMB							       :Rahn:
FROM: [[Rahn,%201979][Rahn]]
*** Description
    - Absolute/adjjusted version of [[TMEMB]]
    - distinguishes between Z-related sets
