doc.html

<div id="outline-container-2-8-2" class="outline-4">
<h4 id="sec-2-8-2"><span class="section-number-4">2.8.2</span> Formula</h4>
<div class="outline-text-4" id="text-2-8-2">

<p>    $$ SIM \left ( X, Y \right ) = \sum_{i = 1}^{6} \left | x_{i} - y_{i} \right | $$   
</p></div>
</div>

</div>

<div id="outline-container-2-9" class="outline-3">
<h3 id="sec-2-9"><span class="section-number-3">2.9</span> ASIM &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Morris">Morris</span></span></h3>
<div class="outline-text-3" id="text-2-9">

<p>   From: <a href="#sec-5">Morris</a>
</p>
</div>

<div id="outline-container-2-9-1" class="outline-4">
<h4 id="sec-2-9-1"><span class="section-number-4">2.9.1</span> Description</h4>
<div class="outline-text-4" id="text-2-9-1">

<ul>
<li>Any size/cardinality:
<ul>
<li>but there is "diminishing return" as the difference between the cardinalities of the two sets increases
</li>
<li>values of SIM increase as the difference in cardinality between sets increases
</li>
<li>ASIM(X,Y): values are weighted by dividing them by the sum of the cardinalities of the sets
</li>
</ul>

</li>
</ul>


</div>

</div>

<div id="outline-container-2-9-2" class="outline-4">
<h4 id="sec-2-9-2"><span class="section-number-4">2.9.2</span> Formula</h4>
<div class="outline-text-4" id="text-2-9-2">


<p>
    $$ ASIM \left ( X, Y \right ) = \frac{SIM \left ( X, Y \right )}{\left ( \# V \left (X \right ) + \# V \left (Y \right ) \right )} $$
</p></div>
</div>

</div>

<div id="outline-container-2-10" class="outline-3">
<h3 id="sec-2-10"><span class="section-number-3">2.10</span> K &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Morris">Morris</span></span></h3>
<div class="outline-text-3" id="text-2-10">

<p>From: <a href="#sec-5">Morris</a>
</p>
</div>

<div id="outline-container-2-10-1" class="outline-4">
<h4 id="sec-2-10-1"><span class="section-number-4">2.10.1</span> Description</h4>
<div class="outline-text-4" id="text-2-10-1">


<ul>
<li>Number of ics in common between the sets X and Y
</li>
<li>It is a function of SIM(X,Y)
</li>
<li>Rahn prefers k to SIM
</li>
</ul>


</div>

</div>

<div id="outline-container-2-10-2" class="outline-4">
<h4 id="sec-2-10-2"><span class="section-number-4">2.10.2</span> Formula</h4>
<div class="outline-text-4" id="text-2-10-2">


<p>    
    $$ k = \frac{\left( \# V  \left( R \right) + \# V  \left( S \right) - SIM  \left( R, S \right) \right)}{2} $$
    Rahn writes it differently (as a funtion of X and Y)
    $$ k\left(X, Y \right) = \frac{\left( \# V  \left( R \right) + \# V  \left( S \right) - SIM  \left( R, S \right) \right)}{2} $$
</p></div>
</div>

</div>

<div id="outline-container-2-11" class="outline-3">
<h3 id="sec-2-11"><span class="section-number-3">2.11</span> AK &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Rahn">Rahn</span></span></h3>
<div class="outline-text-3" id="text-2-11">

<p>   From: <a href="#sec-10">Rahn</a>
</p>
</div>

<div id="outline-container-2-11-1" class="outline-4">
<h4 id="sec-2-11-1"><span class="section-number-4">2.11.1</span> Description</h4>
<div class="outline-text-4" id="text-2-11-1">

<ul>
<li>absolute or adjusted <a href="#sec-2-10">k</a> (from Morris, comparable to <a href="#sec-2-9">ASIM</a>)
</li>
<li>ASIM and Ak are closeley relate
</li>
</ul>

</div>

</div>

<div id="outline-container-2-11-2" class="outline-4">
<h4 id="sec-2-11-2"><span class="section-number-4">2.11.2</span> Fromula</h4>
<div class="outline-text-4" id="text-2-11-2">

<p>    $$ ak \left( X, Y \right) = \frac{2 \times k \left( X, Y \right)}{\# V \left( X \right) + \# V \left( Y \right) }  $$
    $$ Ak(X,Y)=1-ASIM(X,Y) $$
</p></div>
</div>

</div>

<div id="outline-container-2-12" class="outline-3">
<h3 id="sec-2-12"><span class="section-number-3">2.12</span> MEMB &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Rahn">Rahn</span></span></h3>
<div class="outline-text-3" id="text-2-12">

<p>FROM: <a href="#sec-10">Rahn</a>
</p>
</div>

<div id="outline-container-2-12-1" class="outline-4">
<h4 id="sec-2-12-1"><span class="section-number-4">2.12.1</span> Description</h4>
<div class="outline-text-4" id="text-2-12-1">

<ul>
<li><a href="#sec-2-12-2-1">MEMBn</a> counts number of subsets X of size n
</li>
<li>a subset must be present in both X and Y before it is counted 
</li>
<li>by setting n to 2 you get <a href="#sec-2-12-2-2">MEMB2</a> (measure of ic similarity)
</li>
<li>works badly when cardinalities differ greatly
</li>
</ul>

</div>

</div>

<div id="outline-container-2-12-2" class="outline-4">
<h4 id="sec-2-12-2"><span class="section-number-4">2.12.2</span> Formula</h4>
<div class="outline-text-4" id="text-2-12-2">

<ul>
<li id="sec-2-12-2-1">MEMBn<br/>
     $$ MEMB_{n} \left( J,X,Y \right) = EMB \left( J,X \right) + EMB \left( J,Y \right)  $$
     for all J such that
     $$ \# J = n $$
     and
     $$ EMB \left( J,X \right) &gt; 0 $$
     and 
     $$ EMB \left( J,Y \right) &gt; 0 $$
     so&hellip;
     $$ MEMB_{\#X}\left( X,X,Y \right)=EMB\left( X,Y \right) + 1 $$

</li>
</ul>
<ul>
<li id="sec-2-12-2-2">MEMB2<br/>
     $$ MEMB_{2}\left(X,Y\right)=\sum_{i=1}^{6}\left(x_{i}+y_{i}\right) $$
     such that $$ \left(x_{i}&gt;0\right) $$ and $$ \left(y_{i}&gt;0\right) $$
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-2-13" class="outline-3">
<h3 id="sec-2-13"><span class="section-number-3">2.13</span> AMEMB2 &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Isaacson">Isaacson</span></span></h3>
<div class="outline-text-3" id="text-2-13">

<p>From: <a href="#sec-6">Isaacson</a>
</p>
</div>

<div id="outline-container-2-13-1" class="outline-4">
<h4 id="sec-2-13-1"><span class="section-number-4">2.13.1</span> Description</h4>
<div class="outline-text-4" id="text-2-13-1">

<ul>
<li>Isaacson describes a scaled version of <a href="#sec-2-12-2-2">MEMB2</a>
</li>
<li>Applies a normalisation factor equivelant to that used by <a href="#sec-10">Rahn</a> to derive <a href="#sec-2-15">ATMEMB</a> from <a href="#sec-2-14">TMEMB</a>
</li>
<li>range of values decreases as cardinality increases
</li>
<li>AMEMB increases as cardinality increases - troubling
</li>
</ul>

</div>

</div>

<div id="outline-container-2-13-2" class="outline-4">
<h4 id="sec-2-13-2"><span class="section-number-4">2.13.2</span> Formula</h4>
<div class="outline-text-4" id="text-2-13-2">

<p>    $$ AMEMB_{2}=\frac{\sum \left( x_{i}+y_{i} \right)}{\frac{\left(\#X\left(\#X-1\right)+\#Y\left(\#Y-1\right)\right)}{2}} $$
    such that $$ \left(x_{i}&gt;0\right) $$ and $$ \left(y_{i}&gt;0\right) $$
</p></div>
</div>

</div>

<div id="outline-container-2-14" class="outline-3">
<h3 id="sec-2-14"><span class="section-number-3">2.14</span> TMEMB &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Rahn">Rahn</span></span></h3>
<div class="outline-text-3" id="text-2-14">

<p>From: <a href="#sec-10">Rahn</a>
</p>
</div>

<div id="outline-container-2-14-1" class="outline-4">
<h4 id="sec-2-14-1"><span class="section-number-4">2.14.1</span> Description</h4>
<div class="outline-text-4" id="text-2-14-1">

<ul>
<li>the sum of all <a href="#sec-2-12-2-1">MEMBn</a> (n = 2 to 12)
</li>
<li>distinguishes between Z-related sets
</li>
</ul>

</div>

</div>

<div id="outline-container-2-14-2" class="outline-4">
<h4 id="sec-2-14-2"><span class="section-number-4">2.14.2</span> Formula</h4>
<div class="outline-text-4" id="text-2-14-2">

<p>     $$ TMEMB \left( A,B \right) = \sum_{n=2}^{12}MEMB_{n}\left( X,A,B \right) $$
</p></div>
</div>

</div>

<div id="outline-container-2-15" class="outline-3">
<h3 id="sec-2-15"><span class="section-number-3">2.15</span> ATMEMB &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Rahn">Rahn</span></span></h3>
<div class="outline-text-3" id="text-2-15">

<p>FROM: <a href="#sec-10">Rahn</a>
</p>
</div>

<div id="outline-container-2-15-1" class="outline-4">
<h4 id="sec-2-15-1"><span class="section-number-4">2.15.1</span> Description</h4>
<div class="outline-text-4" id="text-2-15-1">

<ul>
<li>Absolute/adjjusted version of <a href="#sec-2-14">TMEMB</a>
</li>
<li>distinguishes between Z-related sets
</li>
</ul>

</div>

</div>
