doc.org
*** Formula

     $$ ATMEMB\left(A,B\right)=\frac{TMEMB\left(A,B\right)}{2^{\#A}+2^{\#B}-\left(\#A+\#B+2\right)} $$
** sf								       :Lord:
From: [[Lord,%201981][Lord]]
*** Description
    - half sum of absolute values of the differences between corresponding IcV entries of the sets
    - sf is a subset of [[SIM]]
    - Same cardinality
    - Lords values can be inferred from [[Morris,%201979][Morris]]'
*** Formula
    $$  sf \left ( X,Y \right ) = \frac{ \sum_{i = 1}^{6} \left | x_{i} - y_{i} \right |}{2}  $$
    where X and Y are any pcset from 3 to 9 notes and
    $$ x_{i} = IcV(X)_{i} $$ and $$ y_{i} = IcV(Y)_{i} $$
** ANGLE							   :Isaacson:
*** Description
** %RELn							    :Castren:
FROM: [[Castren,%201994][Castren]]
*** Description
    - compare proportionate subset-class contents of two set-classes
    - uses [[nC%V]] 
*** Formula
    $$ \%REL_n(X,Y)=\frac{\sum_{i=1}^{p}|x_i-y_i|}{2} $$
    where xi and yi are values in the [[nC%V]]
** %REL2							    :Castren:
FROM: [[Castren,%201994][Castren]]
*** Description
    - is castrens modification of [[Lord,%201981][Lord]]'s [[sf]]
    - [[%RELn]] with n = 2
    - thus measures intervallic similarity
** T%REL							    :Castren:
FROM: [[Castren,%201994][Castren]]
*** Description
    - Total percentage RELation
    - is the arithmetic mean of all %RELn values for n=2 to min(#X,#Y)
    - Considered to be a preliminary version of [[RECREL]]
    - Total measure
** RECREL							    :Castren:
FROM: [[Castren,%201994][Castren]]
*** Description
    - examines the similarity between two set-classes by composing a net of pairings of all embeddable subset-classes, both shared and non- shared.
    - RECREL evaluates function [[%25RELn][%RELn]] many times during the process.
    - The final RECREL value is the arithmetic mean of the individual %RELn values.
** SATSIM							    :Buchler:
*** Description
    - SATuration SIMilarity index
    - based on interval-class saturation vectors ([[SATV]])
** CSATSIM							    :Buchler:
*** Description
    - extension of [[SATSIM]]
** TSATSIM							    :Buchler:
*** Description
    - Total subset SATuration SIMilarity index
    - calculated by dividing the sum of the numerators of all SATSIMn comparisons by the sum of the denominators
    - very similar to [[AvgSATSIM]]
** AvgSATSIM							    :Buchler:
*** Description
   - based on subset-class saturation vectors
   - first calculate SATSIMn values (cardinality class n SATuration SIMilarity), n reaching
from 2 to m-1 (m = min[#X,#Y]).
   - The SATSIMn comparisons are made similarly to the comparisons in SATSIM. The final AvgSATSIM value is the arithmetic mean of the individual SATSIMn values
** IcVD1							     :Rogers:
*** Description
    - Modification of [[Morris,%201979][Morris]]'s [[SIM]]
*** Formula
    $$\%REL_2(X,Y)=IcVd_1(X,Y)\times50 $$
** IcVD2							     :Rogers:
