doc.html

<div id="outline-container-2-15-2" class="outline-4">
<h4 id="sec-2-15-2"><span class="section-number-4">2.15.2</span> Formula</h4>
<div class="outline-text-4" id="text-2-15-2">


<p>
     $$ ATMEMB\left(A,B\right)=\frac{TMEMB\left(A,B\right)}{2^{\#A}+2^{\#B}-\left(\#A+\#B+2\right)} $$
</p></div>
</div>

</div>

<div id="outline-container-2-16" class="outline-3">
<h3 id="sec-2-16"><span class="section-number-3">2.16</span> sf &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Lord">Lord</span></span></h3>
<div class="outline-text-3" id="text-2-16">

<p>From: <a href="#sec-4">Lord</a>
</p>
</div>

<div id="outline-container-2-16-1" class="outline-4">
<h4 id="sec-2-16-1"><span class="section-number-4">2.16.1</span> Description</h4>
<div class="outline-text-4" id="text-2-16-1">

<ul>
<li>half sum of absolute values of the differences between corresponding IcV entries of the sets
</li>
<li>sf is a subset of <a href="#sec-2-8">SIM</a>
</li>
<li>Same cardinality
</li>
<li>Lords values can be inferred from <a href="#sec-5">Morris</a>'
</li>
</ul>

</div>

</div>

<div id="outline-container-2-16-2" class="outline-4">
<h4 id="sec-2-16-2"><span class="section-number-4">2.16.2</span> Formula</h4>
<div class="outline-text-4" id="text-2-16-2">

<p>    $$  sf \left ( X,Y \right ) = \frac{ \sum_{i = 1}^{6} \left | x_{i} - y_{i} \right |}{2}  $$
    where X and Y are any pcset from 3 to 9 notes and
    $$ x_{i} = IcV(X)_{i} $$ and $$ y_{i} = IcV(Y)_{i} $$
</p></div>
</div>

</div>

<div id="outline-container-2-17" class="outline-3">
<h3 id="sec-2-17"><span class="section-number-3">2.17</span> ANGLE &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Isaacson">Isaacson</span></span></h3>
<div class="outline-text-3" id="text-2-17">


</div>

<div id="outline-container-2-17-1" class="outline-4">
<h4 id="sec-2-17-1"><span class="section-number-4">2.17.1</span> Description</h4>
<div class="outline-text-4" id="text-2-17-1">

</div>
</div>

</div>

<div id="outline-container-2-18" class="outline-3">
<h3 id="sec-2-18"><span class="section-number-3">2.18</span> %RELn &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Castren">Castren</span></span></h3>
<div class="outline-text-3" id="text-2-18">

<p>FROM: <a href="#sec-7">Castren</a>
</p>
</div>

<div id="outline-container-2-18-1" class="outline-4">
<h4 id="sec-2-18-1"><span class="section-number-4">2.18.1</span> Description</h4>
<div class="outline-text-4" id="text-2-18-1">

<ul>
<li>compare proportionate subset-class contents of two set-classes
</li>
<li>uses <a href="#sec-19-21">nC%V</a> 
</li>
</ul>

</div>

</div>

<div id="outline-container-2-18-2" class="outline-4">
<h4 id="sec-2-18-2"><span class="section-number-4">2.18.2</span> Formula</h4>
<div class="outline-text-4" id="text-2-18-2">

<p>    $$ \%REL_n(X,Y)=\frac{\sum_{i=1}^{p}|x_i-y_i|}{2} $$
    where xi and yi are values in the <a href="#sec-19-21">nC%V</a>
</p></div>
</div>

</div>

<div id="outline-container-2-19" class="outline-3">
<h3 id="sec-2-19"><span class="section-number-3">2.19</span> %REL2 &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Castren">Castren</span></span></h3>
<div class="outline-text-3" id="text-2-19">

<p>FROM: <a href="#sec-7">Castren</a>
</p>
</div>

<div id="outline-container-2-19-1" class="outline-4">
<h4 id="sec-2-19-1"><span class="section-number-4">2.19.1</span> Description</h4>
<div class="outline-text-4" id="text-2-19-1">

<ul>
<li>is castrens modification of <a href="#sec-4">Lord</a>'s <a href="#sec-2-16">sf</a>
</li>
<li><a href="#sec-2-18">%RELn</a> with n = 2
</li>
<li>thus measures intervallic similarity
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-2-20" class="outline-3">
<h3 id="sec-2-20"><span class="section-number-3">2.20</span> T%REL &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Castren">Castren</span></span></h3>
<div class="outline-text-3" id="text-2-20">

<p>FROM: <a href="#sec-7">Castren</a>
</p>
</div>

<div id="outline-container-2-20-1" class="outline-4">
<h4 id="sec-2-20-1"><span class="section-number-4">2.20.1</span> Description</h4>
<div class="outline-text-4" id="text-2-20-1">

<ul>
<li>Total percentage RELation
</li>
<li>is the arithmetic mean of all %RELn values for n=2 to min(#X,#Y)
</li>
<li>Considered to be a preliminary version of <a href="#sec-2-21">RECREL</a>
</li>
<li>Total measure
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-2-21" class="outline-3">
<h3 id="sec-2-21"><span class="section-number-3">2.21</span> RECREL &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Castren">Castren</span></span></h3>
<div class="outline-text-3" id="text-2-21">

<p>FROM: <a href="#sec-7">Castren</a>
</p>
</div>

<div id="outline-container-2-21-1" class="outline-4">
<h4 id="sec-2-21-1"><span class="section-number-4">2.21.1</span> Description</h4>
<div class="outline-text-4" id="text-2-21-1">

<ul>
<li>examines the similarity between two set-classes by composing a net of pairings of all embeddable subset-classes, both shared and non- shared.
</li>
<li>RECREL evaluates function <a href="#sec-2-18">%RELn</a> many times during the process.
</li>
<li>The final RECREL value is the arithmetic mean of the individual %RELn values.
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-2-22" class="outline-3">
<h3 id="sec-2-22"><span class="section-number-3">2.22</span> SATSIM &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Buchler">Buchler</span></span></h3>
<div class="outline-text-3" id="text-2-22">


</div>

<div id="outline-container-2-22-1" class="outline-4">
<h4 id="sec-2-22-1"><span class="section-number-4">2.22.1</span> Description</h4>
<div class="outline-text-4" id="text-2-22-1">

<ul>
<li>SATuration SIMilarity index
</li>
<li>based on interval-class saturation vectors (<a href="#sec-19-20">SATV</a>)
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-2-23" class="outline-3">
<h3 id="sec-2-23"><span class="section-number-3">2.23</span> CSATSIM &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Buchler">Buchler</span></span></h3>
<div class="outline-text-3" id="text-2-23">


</div>

<div id="outline-container-2-23-1" class="outline-4">
<h4 id="sec-2-23-1"><span class="section-number-4">2.23.1</span> Description</h4>
<div class="outline-text-4" id="text-2-23-1">

<ul>
<li>extension of <a href="#sec-2-22">SATSIM</a>
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-2-24" class="outline-3">
<h3 id="sec-2-24"><span class="section-number-3">2.24</span> TSATSIM &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Buchler">Buchler</span></span></h3>
<div class="outline-text-3" id="text-2-24">


</div>

<div id="outline-container-2-24-1" class="outline-4">
<h4 id="sec-2-24-1"><span class="section-number-4">2.24.1</span> Description</h4>
<div class="outline-text-4" id="text-2-24-1">

<ul>
<li>Total subset SATuration SIMilarity index
</li>
<li>calculated by dividing the sum of the numerators of all SATSIMn comparisons by the sum of the denominators
</li>
<li>very similar to <a href="#sec-2-25">AvgSATSIM</a>
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-2-25" class="outline-3">
<h3 id="sec-2-25"><span class="section-number-3">2.25</span> AvgSATSIM &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Buchler">Buchler</span></span></h3>
<div class="outline-text-3" id="text-2-25">


</div>

<div id="outline-container-2-25-1" class="outline-4">
<h4 id="sec-2-25-1"><span class="section-number-4">2.25.1</span> Description</h4>
<div class="outline-text-4" id="text-2-25-1">

<ul>
<li>based on subset-class saturation vectors
</li>
<li>first calculate SATSIMn values (cardinality class n SATuration SIMilarity), n reaching
</li>
</ul>

<p>from 2 to m-1 (m = min[#X,#Y]).
</p><ul>
<li>The SATSIMn comparisons are made similarly to the comparisons in SATSIM. The final AvgSATSIM value is the arithmetic mean of the individual SATSIMn values
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-2-26" class="outline-3">
<h3 id="sec-2-26"><span class="section-number-3">2.26</span> IcVD1 &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Rogers">Rogers</span></span></h3>
<div class="outline-text-3" id="text-2-26">


</div>

<div id="outline-container-2-26-1" class="outline-4">
<h4 id="sec-2-26-1"><span class="section-number-4">2.26.1</span> Description</h4>
<div class="outline-text-4" id="text-2-26-1">

<ul>
<li>Modification of <a href="#sec-5">Morris</a>'s <a href="#sec-2-8">SIM</a>
</li>
</ul>

</div>

</div>

<div id="outline-container-2-26-2" class="outline-4">
<h4 id="sec-2-26-2"><span class="section-number-4">2.26.2</span> Formula</h4>
<div class="outline-text-4" id="text-2-26-2">

<p>    $$\%REL_2(X,Y)=IcVd_1(X,Y)\times50 $$
</p></div>
</div>

</div>
