doc.tex

\subsubsection{Formula}
\label{sec-3-15-2}

$$ ATMEMB\left(A,B\right)=\frac{TMEMB\left(A,B\right)}{2^{\#A}+2^{\#B}-\left(\#A+\#B+2\right)} $$

\subsection{sf\hfill{}\textsc{Lord}}
\label{sec-3-16}
From: \texttt{Lord}
\subsubsection{Description}
\label{sec-3-16-1}
\begin{itemize}
\item half sum of absolute values of the differences between
corresponding IcV entries of the sets
\item sf is a subset of \ref{sec-3-8}
\item Same cardinality
\item Lords values can be inferred from \texttt{Morris}'
\end{itemize}

\subsubsection{Formula}
\label{sec-3-16-2}
$$  sf \left ( X,Y \right ) = \frac{ \sum_{i = 1}^{6} \left | x_{i} - y_{i} \right |}{2}  $$
where X and Y are any pcset from 3 to 9 notes and
$$ x_{i} = IcV(X)_{i} $$ and $$ y_{i} = IcV(Y)_{i} $$

\subsection{ANGLE\hfill{}\textsc{Isaacson}}
\label{sec-3-17}
\subsubsection{Description}
\label{sec-3-17-1}

\subsection{\%RELn\hfill{}\textsc{Castren}}
\label{sec-3-18}
FROM: \texttt{Castren}
\subsubsection{Description}
\label{sec-3-18-1}
\begin{itemize}
\item compare proportionate subset-class contents of two set-classes
\item uses \ref{sec-21-21}
\end{itemize}

\subsubsection{Formula}
\label{sec-3-18-2}
$$ \%REL_n(X,Y)=\frac{\sum_{i=1}^{p}|x_i-y_i|}{2} $$
where xi and yi are values in the \ref{sec-21-21}

\subsection{\%REL2\hfill{}\textsc{Castren}}
\label{sec-3-19}
FROM: \texttt{Castren}
\subsubsection{Description}
\label{sec-3-19-1}
\begin{itemize}
\item is castrens modification of \texttt{Lord}'s \ref{sec-3-16}
\item \ref{sec-3-18} with n = 2
\item thus measures intervallic similarity
\end{itemize}

\subsection{T\%REL\hfill{}\textsc{Castren}}
\label{sec-3-20}
FROM: \texttt{Castren}
\subsubsection{Description}
\label{sec-3-20-1}
\begin{itemize}
\item Total percentage RELation
\item is the arithmetic mean of all \%RELn values for n=2 to min(\#X,\#Y)
\item Considered to be a preliminary version of \ref{sec-3-21}
\item Total measure
\end{itemize}

\subsection{RECREL\hfill{}\textsc{Castren}}
\label{sec-3-21}
FROM: \texttt{Castren}
\subsubsection{Description}
\label{sec-3-21-1}
\begin{itemize}
\item examines the similarity between two set-classes by composing a
net of pairings of all embeddable subset-classes, both shared
and non- shared.
\item RECREL evaluates function \texttt{\%RELn} many times during the process.
\item The final RECREL value is the arithmetic mean of the individual
\%RELn values.
\end{itemize}

\subsection{SATSIM\hfill{}\textsc{Buchler}}
\label{sec-3-22}
\subsubsection{Description}
\label{sec-3-22-1}
\begin{itemize}
\item SATuration SIMilarity index
\item based on interval-class saturation vectors (\ref{sec-21-20})
\end{itemize}

\subsection{CSATSIM\hfill{}\textsc{Buchler}}
\label{sec-3-23}
\subsubsection{Description}
\label{sec-3-23-1}
\begin{itemize}
\item extension of \ref{sec-3-22}
\end{itemize}

\subsection{TSATSIM\hfill{}\textsc{Buchler}}
\label{sec-3-24}
\subsubsection{Description}
\label{sec-3-24-1}
\begin{itemize}
\item Total subset SATuration SIMilarity index
\item calculated by dividing the sum of the numerators of all SATSIMn
comparisons by the sum of the denominators
\item very similar to \ref{sec-3-25}
\end{itemize}

\subsection{AvgSATSIM\hfill{}\textsc{Buchler}}
\label{sec-3-25}
\subsubsection{Description}
\label{sec-3-25-1}
\begin{itemize}
\item based on subset-class saturation vectors
\item first calculate SATSIMn values (cardinality class n SATuration
SIMilarity), n reaching
\end{itemize}
from 2 to m-1 (m = min[\#X,\#Y]).
\begin{itemize}
\item The SATSIMn comparisons are made similarly to the comparisons in
SATSIM. The final AvgSATSIM value is the arithmetic mean of the
individual SATSIMn values
\end{itemize}

\subsection{IcVD1\hfill{}\textsc{Rogers}}
\label{sec-3-26}
\subsubsection{Description}
\label{sec-3-26-1}
\begin{itemize}
\item Modification of \texttt{Morris}'s \ref{sec-3-8}
\end{itemize}

\subsubsection{Formula}
\label{sec-3-26-2}
$$\%REL_2(X,Y)=IcVd_1(X,Y)\times50 $$
