doc.org
*** Description
    - use IcV like geometric vectors is 6D space
    - IcVD2 is the distance between the ends of the two vectors
    - the IcVs are normalised
*** Formula
    $$ IcVD_2(X,Y)=\sqrt{\sum{( \frac{x_i}{\sqrt{\sum(x_i)^2}}}-\frac{y_i}{\sqrt{\sum(y_i)^2}})^2} $$
** cos(-)							     :Rogers:
*** Description
    - is cos of the angle between the normalised IcVs
*** Formula
    $$ Cos\theta(X,Y)=\frac{\sum{x_i.y_i}}{\sqrt{\sum{(x_i)^2}}.\sqrt{\sum{(y_i)^2}}} $$
* Forte, 1973								 :Rn:
  - =The Structure of Atonal Music=
  - [[R-relations]]
* Lord, 1981								 :sf:
  - =Intervallic Similarity Relations in Atonal Set Analysis=
  - [[sf]]
* Morris, 1979							 :SIM:ASIM:K:
  - =A similarity index for pitch-class sets=
  - [[SIM]], [[ASIM]], [[K]]
* Isaacson, 1990					      :IcVSIM:AMEMB2:
  - =Similarity of Interval-Class Content Between Pitch-Class Sets: The IcVSIM Relation=
  - Isaacson Suggests 3 criteria for a similarity measure
    1. provide a distinct value for every pair of sets
    2. be useful (not just usable) for sets of any size
    3. provide a wide range of discrete values
  - on the basis of these criteria he finds the measures of Teitelbaum, Forte, Morris, Rahn, Lewin, Lord to be inadequate
  - Proposes [[IcVSIM]]
* Castren, 1994							:RECREL:%REL:
* Isaacson, 1996						      :ISIM2:
  - =Issues in the study of similarity in atonal music=
  - Good discussion of similarity over all
  - [[ISIM2]]
  - weighted version of IcVSIM
* Lewin, 1979-80 						   :REL:REL2:
  - =A Response to a Response: On PCSet Relatedness=
  - [[REL]], [[REL2]]
* Rahn, 1979 						  :MEMB:TMEMB:ATMEMB:
  - =Relating Sets=
  - [[MEMB]], [[TMEMB]], [[ATMEMB]]
* Scott & Isaacson, 1998					      :ANGLE:
  - *The Interval Angle: A Similarity Measure for Pitch-Class Sets*
  - ANGLE
  - STATEMENT 11
    - can be generalized for figured-bass
    - The new construction can distinguish between
major and minor chords and between different doublings and different inversions of the chords
  - STATEMENT 12
    - ANGLE M 
    - further extension to ANGLE
* Teitelbaum, 1965							 :si:
  - =Intervallic Relations in Atonal Music=
  - [[s.i.]]
* Samplaski, 2005							:MDS:
=Mapping the Geometries of Pitch-Class Set Similarity Measures via Multidimensional Scaling=
