doc.html

<div id="outline-container-2-27" class="outline-3">
<h3 id="sec-2-27"><span class="section-number-3">2.27</span> IcVD2 &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Rogers">Rogers</span></span></h3>
<div class="outline-text-3" id="text-2-27">


</div>

<div id="outline-container-2-27-1" class="outline-4">
<h4 id="sec-2-27-1"><span class="section-number-4">2.27.1</span> Description</h4>
<div class="outline-text-4" id="text-2-27-1">

<ul>
<li>use IcV like geometric vectors is 6D space
</li>
<li>IcVD2 is the distance between the ends of the two vectors
</li>
<li>the IcVs are normalised
</li>
</ul>

</div>

</div>

<div id="outline-container-2-27-2" class="outline-4">
<h4 id="sec-2-27-2"><span class="section-number-4">2.27.2</span> Formula</h4>
<div class="outline-text-4" id="text-2-27-2">

<p>    $$ IcVD_2(X,Y)=\sqrt{\sum{( \frac{x_i}{\sqrt{\sum(x_i)^2}}}-\frac{y_i}{\sqrt{\sum(y_i)^2}})^2} $$
</p></div>
</div>

</div>

<div id="outline-container-2-28" class="outline-3">
<h3 id="sec-2-28"><span class="section-number-3">2.28</span> cos(-) &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Rogers">Rogers</span></span></h3>
<div class="outline-text-3" id="text-2-28">


</div>

<div id="outline-container-2-28-1" class="outline-4">
<h4 id="sec-2-28-1"><span class="section-number-4">2.28.1</span> Description</h4>
<div class="outline-text-4" id="text-2-28-1">

<ul>
<li>is cos of the angle between the normalised IcVs
</li>
</ul>

</div>

</div>

<div id="outline-container-2-28-2" class="outline-4">
<h4 id="sec-2-28-2"><span class="section-number-4">2.28.2</span> Formula</h4>
<div class="outline-text-4" id="text-2-28-2">

<p>    $$ Cos\theta(X,Y)=\frac{\sum{x_i.y_i}}{\sqrt{\sum{(x_i)^2}}.\sqrt{\sum{(y_i)^2}}} $$
</p></div>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Forte, 1973 &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Rn">Rn</span></span></h2>
<div class="outline-text-2" id="text-3">

<ul>
<li><code>The Structure of Atonal Music</code>
</li>
<li><a href="#sec-2-7">R-relations</a>
</li>
</ul>

</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Lord, 1981 &nbsp;&nbsp;&nbsp;<span class="tag"><span class="sf">sf</span></span></h2>
<div class="outline-text-2" id="text-4">

<ul>
<li><code>Intervallic Similarity Relations in Atonal Set Analysis</code>
</li>
<li><a href="#sec-2-16">sf</a>
</li>
</ul>

</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Morris, 1979 &nbsp;&nbsp;&nbsp;<span class="tag"><span class="SIM">SIM</span>&nbsp;<span class="ASIM">ASIM</span>&nbsp;<span class="K">K</span></span></h2>
<div class="outline-text-2" id="text-5">

<ul>
<li><code>A similarity index for pitch-class sets</code>
</li>
<li><a href="#sec-2-8">SIM</a>, <a href="#sec-2-9">ASIM</a>, <a href="#sec-2-10">K</a>
</li>
</ul>

</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Isaacson, 1990 &nbsp;&nbsp;&nbsp;<span class="tag"><span class="IcVSIM">IcVSIM</span>&nbsp;<span class="AMEMB2">AMEMB2</span></span></h2>
<div class="outline-text-2" id="text-6">

<ul>
<li><code>Similarity of Interval-Class Content Between Pitch-Class Sets: The IcVSIM Relation</code>
</li>
<li>Isaacson Suggests 3 criteria for a similarity measure
<ol>
<li>provide a distinct value for every pair of sets
</li>
<li>be useful (not just usable) for sets of any size
</li>
<li>provide a wide range of discrete values
</li>
</ol>

</li>
<li>on the basis of these criteria he finds the measures of Teitelbaum, Forte, Morris, Rahn, Lewin, Lord to be inadequate
</li>
<li>Proposes <a href="#sec-2-4">IcVSIM</a>
</li>
</ul>

</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Castren, 1994 &nbsp;&nbsp;&nbsp;<span class="tag"><span class="RECREL">RECREL</span>&nbsp;<span class="_REL">%REL</span></span></h2>
<div class="outline-text-2" id="text-7">

</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Isaacson, 1996 &nbsp;&nbsp;&nbsp;<span class="tag"><span class="ISIM2">ISIM2</span></span></h2>
<div class="outline-text-2" id="text-8">

<ul>
<li><code>Issues in the study of similarity in atonal music</code>
</li>
<li>Good discussion of similarity over all
</li>
<li><a href="#sec-2-5">ISIM2</a>
</li>
<li>weighted version of IcVSIM
</li>
</ul>

</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Lewin, 1979-80 &nbsp;&nbsp;&nbsp;<span class="tag"><span class="REL">REL</span>&nbsp;<span class="REL2">REL2</span></span></h2>
<div class="outline-text-2" id="text-9">

<ul>
<li><code>A Response to a Response: On PCSet Relatedness</code>
</li>
<li><a href="#sec-2-1">REL</a>, <a href="#sec-2-2">REL2</a>
</li>
</ul>

</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Rahn, 1979 &nbsp;&nbsp;&nbsp;<span class="tag"><span class="MEMB">MEMB</span>&nbsp;<span class="TMEMB">TMEMB</span>&nbsp;<span class="ATMEMB">ATMEMB</span></span></h2>
<div class="outline-text-2" id="text-10">

<ul>
<li><code>Relating Sets</code>
</li>
<li><a href="#sec-2-12">MEMB</a>, <a href="#sec-2-14">TMEMB</a>, <a href="#sec-2-15">ATMEMB</a>
</li>
</ul>

</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> Scott &amp; Isaacson, 1998 &nbsp;&nbsp;&nbsp;<span class="tag"><span class="ANGLE">ANGLE</span></span></h2>
<div class="outline-text-2" id="text-11">

<ul>
<li><b>The Interval Angle: A Similarity Measure for Pitch-Class Sets</b>
</li>
<li>ANGLE
</li>
<li>STATEMENT 11
<ul>
<li>can be generalized for figured-bass
</li>
<li>The new construction can distinguish between
</li>
</ul>

</li>
</ul>

<p>major and minor chords and between different doublings and different inversions of the chords
</p><ul>
<li>STATEMENT 12
<ul>
<li>ANGLE M 
</li>
<li>further extension to ANGLE
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> Teitelbaum, 1965 &nbsp;&nbsp;&nbsp;<span class="tag"><span class="si">si</span></span></h2>
<div class="outline-text-2" id="text-12">

<ul>
<li><code>Intervallic Relations in Atonal Music</code>
</li>
<li><a href="#sec-2-6">s.i.</a>
</li>
</ul>

</div>

</div>

<div id="outline-container-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> Samplaski, 2005 &nbsp;&nbsp;&nbsp;<span class="tag"><span class="MDS">MDS</span></span></h2>
<div class="outline-text-2" id="text-13">

<p><code>Mapping the Geometries of Pitch-Class Set Similarity Measures via Multidimensional Scaling</code>
</p>
</div>
