doc.org
** methodology
   - 6 pcset similarity measures investigated
     - *3 interval based*
       1. [[Scott%20&%20Isaacson,%201998][ANGLE]]
       2. [[Isaacson,%201990][IcVSIM]]
       3. [[Isaacson,%201996][ISIM2]]
     - *3 subset based* use subset embedding
       1. [[Castren,%201994][RECREL]]
       2. [[ATMEMB]]
       3. [[AMEMB]]
   - *3 cardinalities* under [[TnI][Tn/I]]-equivelance
     - trichords: 3
     - tetrachords: 4
     - pentachords: 5
     - ratings for each cardinality of set-class separately as well as contiguously grouped together (3+4, 4+5, 3+4+5) were studied
   - [[MDS]] applied to matrices of (dis)similarities
   - based on goodness-of-fit analysis...
     - four-dimensional geometric solutions were found for the icv-based measure
     - five-dimensional solutions were found for the subset based measures
** motivation
   1. Visualisation
      - similarity measures yield alot of data
   2. not satisfied with [[Scott%20&%20Isaacson,%201998][scott and isaacoson]] conclusions about correlation
      - correlations (as single, all-subsuming numbers for pairs of measures) do nothing to show what constructs might underlie the ratings being produced.
   3. geometric visualisation allows a "reality check"
      - there might be problems with a measure's numerical ratings that are not evident from inspection of them
   4. [[MDS%20on%20Pcsets%20using%20distance%20function][see here]]
** Conclusions
   The overall results are generally consistent with the idea that these functions all measure constructs relating to familiar scales (diatonic, hexatonic, octatonic, etc.). The results are also compared with several systems of pcset genera. ISIM2 was found to be inconsistent with itself in terms of the geometries it produced. Several set-classes had coordinates near zero along various dimensions in the derived configurations, indicating that in a formal quantitative sense they do not possess the corresponding musical properties being measured; this may raise questions concerning the relative aesthetic worth of some such set-classes.
** more
   - [[CA]] paragraph 18-19
   - [[robustness]] paragraph 20, paragraphs 52-53
   - [[PMDS]] note
* Forte, 1988							     :genera:
  - =Pitch-Class Set Genera and the Origin of Modern Harmonic Species=
  - [[Samplaski,%202005][Samplaski]] paragraph 58
* Parks, 1989							     :genera:
  - =The Music of Claude Debussy=
  - [[Samplaski,%202005][Samplaski]] paragraph 59-60
* Quinn, 1997 							  :genera:CA:
  - =On Similarity, Relations, and Similarity Relations=
  - [[Samplaski,%202005][Samplaski]] paragraph 61
  - used [[CA]] on ratings from similarity measures
  - found correspondence among measures
  - defined 8 genera
    - there were some "fence sitters"
    - argued strongly for a fuzzy set theory of pcset similarity
* Quinn, 2001								 :CA:
  - =Listening to similarity relations=
  - What constitutes a good similarity measure?
    1. The ways in which we are accustomed to talking about similarity relations are not as productive as they seem to be, and there are better ways to do it.
    2. Comparison of various similarity relations from such a different point of view shows that they are more related to each other, and to a lot of other theory, than they appear to be in traditional modes of discourse.
  - [[Samplaski,%202005][Samplaski]] paragraphs 62-63
    - found clusters using monte carlo analysis
* Regener, 1974
  - =On Allen Forte's Theory of Chords=
  - 
* GLOSSARY
** pc
PITCH-CLASS. A set of all pitches that are enharmonically identical and/or related by any number of octaves. There are twelve pcs, numbered from 0 to 11. pc 0 contains all C naturals, all B sharps, all D double-flats; pc 1 contains all Dbs, all C#s; pc 2 contains all Ds, all C##s, all Ebbs, and so forth-pc 11 which contains all Bs, A##s, and Cbs.
From [[Morris,%201979][Morris]]
