doc.html

<div id="outline-container-13-1" class="outline-3">
<h3 id="sec-13-1"><span class="section-number-3">13.1</span> methodology</h3>
<div class="outline-text-3" id="text-13-1">

<ul>
<li>6 pcset similarity measures investigated
<ul>
<li><b>3 interval based</b>
<ol>
<li><a href="#sec-11">ANGLE</a>
</li>
<li><a href="#sec-6">IcVSIM</a>
</li>
<li><a href="#sec-8">ISIM2</a>
</li>
</ol>

</li>
<li><b>3 subset based</b> use subset embedding
<ol>
<li><a href="#sec-7">RECREL</a>
</li>
<li><a href="#sec-2-15">ATMEMB</a>
</li>
<li><a href="#AMEMB">AMEMB</a>
</li>
</ol>

</li>
</ul>

</li>
<li><b>3 cardinalities</b> under <a href="#sec-19-7">Tn/I</a>-equivelance
<ul>
<li>trichords: 3
</li>
<li>tetrachords: 4
</li>
<li>pentachords: 5
</li>
<li>ratings for each cardinality of set-class separately as well as contiguously grouped together (3+4, 4+5, 3+4+5) were studied
</li>
</ul>

</li>
<li><a href="#sec-20">MDS</a> applied to matrices of (dis)similarities
</li>
<li>based on goodness-of-fit analysis&hellip;
<ul>
<li>four-dimensional geometric solutions were found for the icv-based measure
</li>
<li>five-dimensional solutions were found for the subset based measures
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-13-2" class="outline-3">
<h3 id="sec-13-2"><span class="section-number-3">13.2</span> motivation</h3>
<div class="outline-text-3" id="text-13-2">

<ol>
<li>Visualisation
<ul>
<li>similarity measures yield alot of data
</li>
</ul>

</li>
<li>not satisfied with <a href="#sec-11">scott and isaacoson</a> conclusions about correlation
<ul>
<li>correlations (as single, all-subsuming numbers for pairs of measures) do nothing to show what constructs might underlie the ratings being produced.
</li>
</ul>

</li>
<li>geometric visualisation allows a "reality check"
<ul>
<li>there might be problems with a measure's numerical ratings that are not evident from inspection of them
</li>
</ul>

</li>
<li><a href="#MDS-on-Pcsets-using-distance-function">see here</a>
</li>
</ol>

</div>

</div>

<div id="outline-container-13-3" class="outline-3">
<h3 id="sec-13-3"><span class="section-number-3">13.3</span> Conclusions</h3>
<div class="outline-text-3" id="text-13-3">

<p>   The overall results are generally consistent with the idea that these functions all measure constructs relating to familiar scales (diatonic, hexatonic, octatonic, etc.). The results are also compared with several systems of pcset genera. ISIM2 was found to be inconsistent with itself in terms of the geometries it produced. Several set-classes had coordinates near zero along various dimensions in the derived configurations, indicating that in a formal quantitative sense they do not possess the corresponding musical properties being measured; this may raise questions concerning the relative aesthetic worth of some such set-classes.
</p></div>

</div>

<div id="outline-container-13-4" class="outline-3">
<h3 id="sec-13-4"><span class="section-number-3">13.4</span> more</h3>
<div class="outline-text-3" id="text-13-4">

<ul>
<li><a href="#sec-20-11">CA</a> paragraph 18-19
</li>
<li><a href="#sec-19-17">robustness</a> paragraph 20, paragraphs 52-53
</li>
<li><a href="#sec-20-12">PMDS</a> note
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> Forte, 1988 &nbsp;&nbsp;&nbsp;<span class="tag"><span class="genera">genera</span></span></h2>
<div class="outline-text-2" id="text-14">

<ul>
<li><code>Pitch-Class Set Genera and the Origin of Modern Harmonic Species</code>
</li>
<li><a href="#sec-13">Samplaski</a> paragraph 58
</li>
</ul>

</div>

</div>

<div id="outline-container-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> Parks, 1989 &nbsp;&nbsp;&nbsp;<span class="tag"><span class="genera">genera</span></span></h2>
<div class="outline-text-2" id="text-15">

<ul>
<li><code>The Music of Claude Debussy</code>
</li>
<li><a href="#sec-13">Samplaski</a> paragraph 59-60
</li>
</ul>

</div>

</div>

<div id="outline-container-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> Quinn, 1997 &nbsp;&nbsp;&nbsp;<span class="tag"><span class="genera">genera</span>&nbsp;<span class="CA">CA</span></span></h2>
<div class="outline-text-2" id="text-16">

<ul>
<li><code>On Similarity, Relations, and Similarity Relations</code>
</li>
<li><a href="#sec-13">Samplaski</a> paragraph 61
</li>
<li>used <a href="#sec-20-11">CA</a> on ratings from similarity measures
</li>
<li>found correspondence among measures
</li>
<li>defined 8 genera
<ul>
<li>there were some "fence sitters"
</li>
<li>argued strongly for a fuzzy set theory of pcset similarity
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-17" class="outline-2">
<h2 id="sec-17"><span class="section-number-2">17</span> Quinn, 2001 &nbsp;&nbsp;&nbsp;<span class="tag"><span class="CA">CA</span></span></h2>
<div class="outline-text-2" id="text-17">

<ul>
<li><code>Listening to similarity relations</code>
</li>
<li>What constitutes a good similarity measure?
<ol>
<li>The ways in which we are accustomed to talking about similarity relations are not as productive as they seem to be, and there are better ways to do it.
</li>
<li>Comparison of various similarity relations from such a different point of view shows that they are more related to each other, and to a lot of other theory, than they appear to be in traditional modes of discourse.
</li>
</ol>

</li>
<li><a href="#sec-13">Samplaski</a> paragraphs 62-63
<ul>
<li>found clusters using monte carlo analysis
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-18" class="outline-2">
<h2 id="sec-18"><span class="section-number-2">18</span> Regener, 1974</h2>
<div class="outline-text-2" id="text-18">

<ul>
<li><code>On Allen Forte's Theory of Chords</code>
</li>
<li>
</li>
</ul>

</div>

</div>

<div id="outline-container-19" class="outline-2">
<h2 id="sec-19"><span class="section-number-2">19</span> GLOSSARY</h2>
<div class="outline-text-2" id="text-19">


</div>

<div id="outline-container-19-1" class="outline-3">
<h3 id="sec-19-1"><span class="section-number-3">19.1</span> pc</h3>
<div class="outline-text-3" id="text-19-1">

<p>PITCH-CLASS. A set of all pitches that are enharmonically identical and/or related by any number of octaves. There are twelve pcs, numbered from 0 to 11. pc 0 contains all C naturals, all B sharps, all D double-flats; pc 1 contains all Dbs, all C#s; pc 2 contains all Ds, all C##s, all Ebbs, and so forth-pc 11 which contains all Bs, A##s, and Cbs.
From <a href="#sec-5">Morris</a>
</p></div>

</div>
