doc.tex
\subsection{methodology}
\label{sec-15-1}
\begin{itemize}
\item 6 pcset similarity measures investigated
\begin{itemize}
\item \textbf{3 interval based}
\begin{enumerate}
\item \texttt{ANGLE}
\item \texttt{IcVSIM}
\item \texttt{ISIM2}
\end{enumerate}
\item \textbf{3 subset based} use subset embedding
\begin{enumerate}
\item \texttt{RECREL}
\item \ref{sec-3-15}
\item \texttt{AMEMB}
\end{enumerate}
\end{itemize}
\item \textbf{3 cardinalities} under \hyperref[sec-21-7]{Tn/I}-equivelance
\begin{itemize}
\item trichords: 3
\item tetrachords: 4
\item pentachords: 5
\item ratings for each cardinality of set-class separately as well as
contiguously grouped together (3+4, 4+5, 3+4+5) were studied
\end{itemize}
\item \ref{sec-22} applied to matrices of (dis)similarities
\item based on goodness-of-fit analysis\ldots{}
\begin{itemize}
\item four-dimensional geometric solutions were found for the
icv-based measure
\item five-dimensional solutions were found for the subset based
measures
\end{itemize}
\end{itemize}

\subsection{motivation}
\label{sec-15-2}
\begin{enumerate}
\item Visualisation
\begin{itemize}
\item similarity measures yield alot of data
\end{itemize}
\item not satisfied with \texttt{scott and isaacoson} conclusions about
correlation
\begin{itemize}
\item correlations (as single, all-subsuming numbers for pairs of
measures) do nothing to show what constructs might underlie
the ratings being produced.
\end{itemize}
\item geometric visualisation allows a "reality check"
\begin{itemize}
\item there might be problems with a measure's numerical ratings
that are not evident from inspection of them
\end{itemize}
\item \texttt{see here}
\end{enumerate}

\subsection{Conclusions}
\label{sec-15-3}
The overall results are generally consistent with the idea that
these functions all measure constructs relating to familiar scales
(diatonic, hexatonic, octatonic, etc.). The results are also
compared with several systems of pcset genera. ISIM2 was found to
be inconsistent with itself in terms of the geometries it
produced. Several set-classes had coordinates near zero along
various dimensions in the derived configurations, indicating that
in a formal quantitative sense they do not possess the
corresponding musical properties being measured; this may raise
questions concerning the relative aesthetic worth of some such
set-classes.

\subsection{more}
\label{sec-15-4}
\begin{itemize}
\item \ref{sec-22-11} paragraph 18-19
\item \ref{sec-21-17} paragraph 20, paragraphs 52-53
\item \ref{sec-22-12} note
\end{itemize}

\section{Forte, 1988\hfill{}\textsc{genera}}
\label{sec-16}
\begin{itemize}
\item \texttt{Pitch-Class Set Genera and the Origin of Modern Harmonic Species}
\item \texttt{Samplaski} paragraph 58
\end{itemize}

\section{Parks, 1989\hfill{}\textsc{genera}}
\label{sec-17}
\begin{itemize}
\item \texttt{The Music of Claude Debussy}
\item \texttt{Samplaski} paragraph 59-60
\end{itemize}

\section{Quinn, 1997\hfill{}\textsc{genera:CA}}
\label{sec-18}
\begin{itemize}
\item \texttt{On Similarity, Relations, and Similarity Relations}
\item \texttt{Samplaski} paragraph 61
\item used \ref{sec-22-11} on ratings from similarity measures
\item found correspondence among measures
\item defined 8 genera
\begin{itemize}
\item there were some "fence sitters"
\item argued strongly for a fuzzy set theory of pcset similarity
\end{itemize}
\end{itemize}

\section{Quinn, 2001\hfill{}\textsc{CA}}
\label{sec-19}
\begin{itemize}
\item \texttt{Listening to similarity relations}
\item What constitutes a good similarity measure?
\begin{enumerate}
\item The ways in which we are accustomed to talking about similarity
relations are not as productive as they seem to be, and there
are better ways to do it.
\item Comparison of various similarity relations from such a
different point of view shows that they are more related to
each other, and to a lot of other theory, than they appear to
be in traditional modes of discourse.
\end{enumerate}
\item \texttt{Samplaski} paragraphs 62-63
\begin{itemize}
\item found clusters using monte carlo analysis
\end{itemize}
\end{itemize}

\section{Regener, 1974}
\label{sec-20}
\begin{itemize}
\item \texttt{On Allen Forte's Theory of Chords}
\item 
\end{itemize}

\section{GLOSSARY}
\label{sec-21}
\subsection{pc}
\label{sec-21-1}
PITCH-CLASS. A set of all pitches that are enharmonically identical
and/or related by any number of octaves. There are twelve pcs,
numbered from 0 to 11. pc 0 contains all C naturals, all B sharps, all
D double-flats; pc 1 contains all Dbs, all C\#s; pc 2 contains all Ds,
all C\#\#s, all Ebbs, and so forth-pc 11 which contains all Bs, A\#\#s,
and Cbs.  From \texttt{Morris}
