doc.html

<div id="outline-container-19-2" class="outline-3">
<h3 id="sec-19-2"><span class="section-number-3">19.2</span> ic</h3>
<div class="outline-text-3" id="text-19-2">

<p>INTERVAL CLASS. A set of all interval that differ by multiples of 12 semi-tones and/or are complementary respect with to the octave. There are six ics, numbered
from 1 to 6. ic 1 contains all minor 2nds, all major 7ths, all diminished octaves, all augmented 8ves, all min 9ths, etc.; ic 2 contains all major 2nds, all dim 3rds, all aug 6ths, all min 7ths, all maj 9ths,etc. -and so forth-ic 6 contains all tritones, and intervals of a tritone plus any amount of octaves. The ic may also be defined as the set of intervals between any of the members of one pc and any of the members of another. The intervals between any D # and any F are all members of ic 2.
From <a href="#sec-5">Morris</a>
</p></div>

</div>

<div id="outline-container-19-3" class="outline-3">
<h3 id="sec-19-3"><span class="section-number-3">19.3</span> set</h3>
<div class="outline-text-3" id="text-19-3">

<p>An unordered collection of pcs without replication. The set (0,3,4) is the same as (0,4,3) and (4,3,0), etc. A particular set may be denoted by a capital letter. For instance, T = (0,3,4). There are 4,096 distinct sets.
From <a href="#sec-5">Morris</a>
</p></div>

</div>

<div id="outline-container-19-4" class="outline-3">
<h3 id="sec-19-4"><span class="section-number-3">19.4</span> SC</h3>
<div class="outline-text-3" id="text-19-4">

<p>SET-CLASS. A collection of sets related to one another by Tn and/or I.
From <a href="#sec-5">Morris</a>
</p></div>

</div>

<div id="outline-container-19-5" class="outline-3">
<h3 id="sec-19-5"><span class="section-number-3">19.5</span> Tn</h3>
<div class="outline-text-3" id="text-19-5">

<p>Tn TRANSPOSITION by 'n' semitones 'higher'. To transpose a set we add n to each pc in the set; if the sum exceeds 11, we reduce it by 12. If the set (8,5,7) is subjected to T5, the result is 8+5, 5+5, and 7+5 or (1,10,0). If W=(8,5,7), then (1,10,0) may be written T5W.
From <a href="#sec-5">Morris</a>
</p></div>

</div>

<div id="outline-container-19-6" class="outline-3">
<h3 id="sec-19-6"><span class="section-number-3">19.6</span> I</h3>
<div class="outline-text-3" id="text-19-6">

<p>INVERSION. An operation on pcs which sends, 1 to 11 and vice- versa, 2 to 10 and the reverse, 3 to 9, 4 to 8, 5 to 7, while 0 and 6 remain the same. The inversion of the set (6,8,4,3) is (6,4,8,9) (and vice-versa). If (6,8,4,3) = D, then ID = (6,4,8,9).
From <a href="#sec-5">Morris</a>
</p></div>

</div>

<div id="outline-container-19-7" class="outline-3">
<h3 id="sec-19-7"><span class="section-number-3">19.7</span> TnI</h3>
<div class="outline-text-3" id="text-19-7">

<p>Inversion followed by transposition. T5I of (7,9.4) is produced by taking the inversion which is (5,3,8) and transposing it by T5 which results in (10,8,1). If our original set is L, then T5IL= (10,8,1).
From <a href="#sec-5">Morris</a>
</p></div>

</div>

<div id="outline-container-19-8" class="outline-3">
<h3 id="sec-19-8"><span class="section-number-3">19.8</span> Invariance</h3>
<div class="outline-text-3" id="text-19-8">

<p>A set is invariant if it remains unchanged after transformation under Tn or I or both. T4I of the set H which is (3,1,8) results in invariances since 3 becomes 9+4 or 1, 1 becomes 11+4 or 3, and 8 becomes 4+4 or 8. We say that our set is invariant under T4I. T4H= H
From <a href="#sec-5">Morris</a>
</p></div>

</div>

<div id="outline-container-19-9" class="outline-3">
<h3 id="sec-19-9"><span class="section-number-3">19.9</span> V</h3>
<div class="outline-text-3" id="text-19-9">

<p>INTERVAL-CLASS-VECTOR. A listing of the amount of ics of each type in a particular set. V(Y) is the interval-class-vector associated with the set Y. A V is an array of six numbers square brackets. The first number is called V1 and gives the amount of ic Is in the set; the second number or argument, V2, is the number of ic 2s in the set; etc., to the sixth argument, V6, which gives the number of ic 6s. In the expression, V(B) = [1,1,1,0,0,0], we are asserting the set B has one ic 1, one ic 2, one ic 3, and no ic 4, 5, or 6. The set (5,7,8) could be B. We may determine the V of any set by examining all pairs of pcs in the set, finding the ic for each pair, and registering it in the appropriate argument in the array. If the set R is (8,4,2,0) the ic for 8 and 4 is 4; the ic for 8 and 2 is 6; the ic for 8 and 0 is 4; the ic for 4 and 2 is 2; for 4 and 0 we have 4 and for 2 and 0 we have 2. Thus, V(R) = [0,2,0,3,0,1].
From <a href="#sec-5">Morris</a>
</p></div>

</div>

<div id="outline-container-19-10" class="outline-3">
<h3 id="sec-19-10"><span class="section-number-3">19.10</span> #R</h3>
<div class="outline-text-3" id="text-19-10">

<p>Where R is a set, #R denotes its cardinality, is, the number that of pcs in R.
From <a href="#sec-5">Morris</a>
</p></div>

</div>

<div id="outline-container-19-11" class="outline-3">
<h3 id="sec-19-11"><span class="section-number-3">19.11</span> #(V)R</h3>
<div class="outline-text-3" id="text-19-11">

<p>The number of ics in V(R). Where R contains n pcs (n = #R), 4V(R) is equal to the sum of whole numbers starting with 1 and ending with (n-1). A set of seven pcs has 1+2+3+4+5+6 or 21 ics.
From <a href="#sec-5">Morris</a>
</p></div>

</div>

<div id="outline-container-19-12" class="outline-3">
<h3 id="sec-19-12"><span class="section-number-3">19.12</span> Membership &isin;</h3>
<div class="outline-text-3" id="text-19-12">

<p>5 &isin; (8,5,7) d &isin; R (a pc named d is a member of the set R). 
From <a href="#sec-5">Morris</a>
</p></div>

</div>

<div id="outline-container-19-13" class="outline-3">
<h3 id="sec-19-13"><span class="section-number-3">19.13</span> Inclusion &sub;</h3>
<div class="outline-text-3" id="text-19-13">

<p>R &sub; T if every pc in set R is also in set T (R is a sub-set of T).
(7,5,8) &sub; (8,5,3,7,0)
From <a href="#sec-5">Morris</a>
</p></div>

</div>

<div id="outline-container-19-14" class="outline-3">
<h3 id="sec-19-14"><span class="section-number-3">19.14</span> | x | (Absolute Value)</h3>
<div class="outline-text-3" id="text-19-14">

<p>Take the positive sign of the expression enclosed in Is. | 5 | = 5; | -7 | = (+)7; | 7-2 | = | 2-7 |.
From <a href="#sec-5">Morris</a>
</p></div>

</div>
