doc.org
** Genera
   - classical
     - an object either belongs or does not
   - fuzzy
     - an object has a probability of belonging
   - many genera systems have been proposed
     - Ericksson, 1986
     - [[Forte,%201988][Forte, 1988]]
     - [[Parks,%201989][Parks, 1989]]
     - [[Quinn,%201997][Quinn, 1997]]
     - [[Quinn,%202001][Quinn, 2001]]
   - Some dont relate directly to pcsets: e.g., Hanson, 1960; Harris, 1989; Hindemith, 1937/42; Wolpert, 1951, 1972
** Z-Relation
   - Same icv but not related by TnI
** robustness
  - whether changing the set of objects being compared alters the perceived/computed similarity between the original set of objects.
  - "yields consistent relative MDS geometries, save for scaling, regardless of surrounding context" [[Samplaski,%202005][samp]] paragraph 21
  - [[Samplaski,%202005][Samplaski]] tested robustness of similarity measures by analysing cardinalities in isolation as well as combinations of contiguous cardinalities
** Significance
  - the probability that the observed result might have occurred by chance
  - [[Samplaski,%202005][Samplaski]] paragraph 27
** IdV
   - Interval-difference Vector
   - the difference between the terms of 2 ic-vectors
** SATV
  - Bruchler uses them in [[SATSIM]]
  - derived by comparing the number of instances of each interval-class in a set-class with both the minimum and the maximum number of the corresponding interval-class instances that can be found in any set-class of the same cardinality
  - From a saturation vector one can thus see the degree of saturation of each interval-class vector component.
  - Kussi Appendix 2 
** nC%V
   - n-class percentage vector
   - modification of a [[nCV]] from castren
   - used in [[%RELn]]
** nCV
  - array of numbers corresponding to EMB(A,X)
  - with A running through all set-classes in cardinality class n
* MDS
*** non-metric MDS
    - Shepard (1962), Kruskal (1964a, 1964b)
    - assumes that the distance or proximity values of the matrix are directly related by some unknown function to distances between the objects in some underlying abstract N-dimensional Euclidean space, whose distance metric is the generalized version of the formula familiar from Cartesian geometry, SQRT(x2 + y2 + z2 + ...).
    - distances are symmetric
*** Issues
    1. how do we determine the best [[dimensionality]]?
       - important to minimize the number of dimensions
	 - for visualisation
	 - and parsiomony of explanation
	   - as the number of free parameters increases there become too few constraints on the possible configuration.
       - For a given dimensionality, we obtain two values: [[Stress][stress]] and [[r2]]
       - the number of objects should be at least 3-4 times greater than the highest anticipated dimensionality. [[Samplaski,%202005][samplaski]] paragraph 17
    2. inherent underlying [[asymmetry][asymmetries]]?
       - [[Samplaski,%202005][samplaski]] paragraph 12
       - a number of models for dealing with this
	 - [[ASCAL]]
    3. [[Exemplars]]
*** Stress
    - *goodness of fit measure* 
    - Discrepancies between the actual data values and the derived underlying distances are accounted for in a goodness-of-fit measure called "stress": as the number of dimensions increases, stress decreases, and choosing between configurations of different dimensionalities becomes an issue. (Samplaski)
*** r2
    - r-squared
    - percentage of the variability of the data being explained by the solution
*** elbows
    - plot the stress and r2 values for several dimensionalities
    - look for "elbows" (inflection points) in the plots.
    - If an elbow exists, then the higher-dimensional solutions are not giving significant additional explanation--the plot suddenly flattens out.
    - [[Samplaski,%202005][samplaski]] paragraph 17
