doc.html

<div id="outline-container-19-15" class="outline-3">
<h3 id="sec-19-15"><span class="section-number-3">19.15</span> Genera</h3>
<div class="outline-text-3" id="text-19-15">

<ul>
<li>classical
<ul>
<li>an object either belongs or does not
</li>
</ul>

</li>
<li>fuzzy
<ul>
<li>an object has a probability of belonging
</li>
</ul>

</li>
<li>many genera systems have been proposed
<ul>
<li>Ericksson, 1986
</li>
<li><a href="#sec-14">Forte, 1988</a>
</li>
<li><a href="#sec-15">Parks, 1989</a>
</li>
<li><a href="#sec-16">Quinn, 1997</a>
</li>
<li><a href="#sec-17">Quinn, 2001</a>
</li>
</ul>

</li>
<li>Some dont relate directly to pcsets: e.g., Hanson, 1960; Harris, 1989; Hindemith, 1937/42; Wolpert, 1951, 1972
</li>
</ul>

</div>

</div>

<div id="outline-container-19-16" class="outline-3">
<h3 id="sec-19-16"><span class="section-number-3">19.16</span> Z-Relation</h3>
<div class="outline-text-3" id="text-19-16">

<ul>
<li>Same icv but not related by TnI
</li>
</ul>

</div>

</div>

<div id="outline-container-19-17" class="outline-3">
<h3 id="sec-19-17"><span class="section-number-3">19.17</span> robustness</h3>
<div class="outline-text-3" id="text-19-17">

<ul>
<li>whether changing the set of objects being compared alters the perceived/computed similarity between the original set of objects.
</li>
<li>"yields consistent relative MDS geometries, save for scaling, regardless of surrounding context" <a href="#sec-13">samp</a> paragraph 21
</li>
<li><a href="#sec-13">Samplaski</a> tested robustness of similarity measures by analysing cardinalities in isolation as well as combinations of contiguous cardinalities
</li>
</ul>

</div>

</div>

<div id="outline-container-19-18" class="outline-3">
<h3 id="sec-19-18"><span class="section-number-3">19.18</span> Significance</h3>
<div class="outline-text-3" id="text-19-18">

<ul>
<li>the probability that the observed result might have occurred by chance
</li>
<li><a href="#sec-13">Samplaski</a> paragraph 27
</li>
</ul>

</div>

</div>

<div id="outline-container-19-19" class="outline-3">
<h3 id="sec-19-19"><span class="section-number-3">19.19</span> IdV</h3>
<div class="outline-text-3" id="text-19-19">

<ul>
<li>Interval-difference Vector
</li>
<li>the difference between the terms of 2 ic-vectors
</li>
</ul>

</div>

</div>

<div id="outline-container-19-20" class="outline-3">
<h3 id="sec-19-20"><span class="section-number-3">19.20</span> SATV</h3>
<div class="outline-text-3" id="text-19-20">

<ul>
<li>Bruchler uses them in <a href="#sec-2-22">SATSIM</a>
</li>
<li>derived by comparing the number of instances of each interval-class in a set-class with both the minimum and the maximum number of the corresponding interval-class instances that can be found in any set-class of the same cardinality
</li>
<li>From a saturation vector one can thus see the degree of saturation of each interval-class vector component.
</li>
<li>Kussi Appendix 2 
</li>
</ul>

</div>

</div>

<div id="outline-container-19-21" class="outline-3">
<h3 id="sec-19-21"><span class="section-number-3">19.21</span> nC%V</h3>
<div class="outline-text-3" id="text-19-21">

<ul>
<li>n-class percentage vector
</li>
<li>modification of a <a href="#sec-19-22">nCV</a> from castren
</li>
<li>used in <a href="#sec-2-18">%RELn</a>
</li>
</ul>

</div>

</div>

<div id="outline-container-19-22" class="outline-3">
<h3 id="sec-19-22"><span class="section-number-3">19.22</span> nCV</h3>
<div class="outline-text-3" id="text-19-22">

<ul>
<li>array of numbers corresponding to EMB(A,X)
</li>
<li>with A running through all set-classes in cardinality class n
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-20" class="outline-2">
<h2 id="sec-20"><span class="section-number-2">20</span> MDS</h2>
<div class="outline-text-2" id="text-20">


</div>

<div id="outline-container-20-1" class="outline-4">
<h4 id="sec-20-1"><span class="section-number-4">20.1</span> non-metric MDS</h4>
<div class="outline-text-4" id="text-20-1">

<ul>
<li>Shepard (1962), Kruskal (1964a, 1964b)
</li>
<li>assumes that the distance or proximity values of the matrix are directly related by some unknown function to distances between the objects in some underlying abstract N-dimensional Euclidean space, whose distance metric is the generalized version of the formula familiar from Cartesian geometry, SQRT(x2 + y2 + z2 + &hellip;).
</li>
<li>distances are symmetric
</li>
</ul>

</div>

</div>

<div id="outline-container-20-2" class="outline-4">
<h4 id="sec-20-2"><span class="section-number-4">20.2</span> Issues</h4>
<div class="outline-text-4" id="text-20-2">

<ol>
<li>how do we determine the best <a href="#sec-20-6">dimensionality</a>?
<ul>
<li>important to minimize the number of dimensions
<ul>
<li>for visualisation
</li>
<li>and parsiomony of explanation
<ul>
<li>as the number of free parameters increases there become too few constraints on the possible configuration.
</li>
</ul>

</li>
</ul>

</li>
<li>For a given dimensionality, we obtain two values: <a href="#sec-20-3">stress</a> and <a href="#sec-20-4">r2</a>
</li>
<li>the number of objects should be at least 3-4 times greater than the highest anticipated dimensionality. <a href="#sec-13">samplaski</a> paragraph 17
</li>
</ul>

</li>
<li>inherent underlying <a href="#sec-20-7">asymmetries</a>?
<ul>
<li><a href="#sec-13">samplaski</a> paragraph 12
</li>
<li>a number of models for dealing with this
<ul>
<li><a href="#sec-20-10">ASCAL</a>
</li>
</ul>

</li>
</ul>

</li>
<li><a href="#sec-20-8">Exemplars</a>
</li>
</ol>

</div>

</div>

<div id="outline-container-20-3" class="outline-4">
<h4 id="sec-20-3"><span class="section-number-4">20.3</span> Stress</h4>
<div class="outline-text-4" id="text-20-3">

<ul>
<li><b>goodness of fit measure</b> 
</li>
<li>Discrepancies between the actual data values and the derived underlying distances are accounted for in a goodness-of-fit measure called "stress": as the number of dimensions increases, stress decreases, and choosing between configurations of different dimensionalities becomes an issue. (Samplaski)
</li>
</ul>

</div>

</div>

<div id="outline-container-20-4" class="outline-4">
<h4 id="sec-20-4"><span class="section-number-4">20.4</span> r2</h4>
<div class="outline-text-4" id="text-20-4">

<ul>
<li>r-squared
</li>
<li>percentage of the variability of the data being explained by the solution
</li>
</ul>

</div>

</div>

<div id="outline-container-20-5" class="outline-4">
<h4 id="sec-20-5"><span class="section-number-4">20.5</span> elbows</h4>
<div class="outline-text-4" id="text-20-5">

<ul>
<li>plot the stress and r2 values for several dimensionalities
</li>
<li>look for "elbows" (inflection points) in the plots.
</li>
<li>If an elbow exists, then the higher-dimensional solutions are not giving significant additional explanation&ndash;the plot suddenly flattens out.
</li>
<li><a href="#sec-13">samplaski</a> paragraph 17
</li>
</ul>

</div>

</div>
