doc.tex

\subsection{Genera}
\label{sec-21-15}
\begin{itemize}
\item classical
\begin{itemize}
\item an object either belongs or does not
\end{itemize}
\item fuzzy
\begin{itemize}
\item an object has a probability of belonging
\end{itemize}
\item many genera systems have been proposed
\begin{itemize}
\item Ericksson, 1986
\item \texttt{Forte, 1988}
\item \texttt{Parks, 1989}
\item \texttt{Quinn, 1997}
\item \texttt{Quinn, 2001}
\end{itemize}
\item Some dont relate directly to pcsets: e.g., Hanson, 1960; Harris,
1989; Hindemith, 1937/42; Wolpert, 1951, 1972
\end{itemize}

\subsection{Z-Relation}
\label{sec-21-16}
\begin{itemize}
\item Same icv but not related by TnI
\end{itemize}

\subsection{robustness}
\label{sec-21-17}
\begin{itemize}
\item whether changing the set of objects being compared alters the
perceived/computed similarity between the original set of objects.
\item "yields consistent relative MDS geometries, save for scaling,
regardless of surrounding context" \texttt{samp} paragraph 21
\item \texttt{Samplaski} tested robustness of similarity measures by analysing
cardinalities in isolation as well as combinations of contiguous
cardinalities
\end{itemize}

\subsection{Significance}
\label{sec-21-18}
\begin{itemize}
\item the probability that the observed result might have occurred by
chance
\item \texttt{Samplaski} paragraph 27
\end{itemize}

\subsection{IdV}
\label{sec-21-19}
\begin{itemize}
\item Interval-difference Vector
\item the difference between the terms of 2 ic-vectors
\end{itemize}

\subsection{SATV}
\label{sec-21-20}
\begin{itemize}
\item Bruchler uses them in \ref{sec-3-22}
\item derived by comparing the number of instances of each
interval-class in a set-class with both the minimum and the
maximum number of the corresponding interval-class instances that
can be found in any set-class of the same cardinality
\item From a saturation vector one can thus see the degree of saturation
of each interval-class vector component.
\item Kussi Appendix 2
\end{itemize}

\subsection{nC\%V}
\label{sec-21-21}
\begin{itemize}
\item n-class percentage vector
\item modification of a \ref{sec-21-22} from castren
\item used in \ref{sec-3-18}
\end{itemize}

\subsection{nCV}
\label{sec-21-22}
\begin{itemize}
\item array of numbers corresponding to EMB(A,X)
\item with A running through all set-classes in cardinality class n
\end{itemize}

\section{MDS}
\label{sec-22}
\subsection{non-metric MDS}
\label{sec-22-1}
\begin{itemize}
\item Shepard (1962), Kruskal (1964a, 1964b)
\item assumes that the distance or proximity values of the matrix are
directly related by some unknown function to distances between
the objects in some underlying abstract N-dimensional Euclidean
space, whose distance metric is the generalized version of the
formula familiar from Cartesian geometry, SQRT(x2 + y2 + z2 +
\ldots{}).
\item distances are symmetric
\end{itemize}

\subsection{Issues}
\label{sec-22-2}
\begin{enumerate}
\item how do we determine the best \ref{sec-22-6}?
\begin{itemize}
\item important to minimize the number of dimensions
\begin{itemize}
\item for visualisation
\item and parsiomony of explanation
\begin{itemize}
\item as the number of free parameters increases there become
too few constraints on the possible configuration.
\end{itemize}
\end{itemize}
\item For a given dimensionality, we obtain two values: \hyperref[sec-22-3]{stress} and
         \ref{sec-22-4}
\item the number of objects should be at least 3-4 times greater
than the highest anticipated dimensionality. \texttt{samplaski}
paragraph 17
\end{itemize}
\item inherent underlying \hyperref[sec-22-7]{asymmetries}?
\begin{itemize}
\item \texttt{samplaski} paragraph 12
\item a number of models for dealing with this
\begin{itemize}
\item \ref{sec-22-10}
\end{itemize}
\end{itemize}
\item \ref{sec-22-8}
\end{enumerate}

\subsection{Stress}
\label{sec-22-3}
\begin{itemize}
\item \textbf{goodness of fit measure}
\item Discrepancies between the actual data values and the derived
underlying distances are accounted for in a goodness-of-fit
measure called "stress": as the number of dimensions increases,
stress decreases, and choosing between configurations of
different dimensionalities becomes an issue. (Samplaski)
\end{itemize}

\subsection{r2}
\label{sec-22-4}
\begin{itemize}
\item r-squared
\item percentage of the variability of the data being explained by the
solution
\end{itemize}

\subsection{elbows}
\label{sec-22-5}
\begin{itemize}
\item plot the stress and r2 values for several dimensionalities
\item look for "elbows" (inflection points) in the plots.
\item If an elbow exists, then the higher-dimensional solutions are
not giving significant additional explanation--the plot suddenly
flattens out.
\item \texttt{samplaski} paragraph 17
\end{itemize}
