doc.org
*** dimensionality
    - choose dimensionality on the bases of clarity and logical interpretation.
    - one dimension above or below "optimal" as indicated by the stress/r2 values might be better:
      1. if there is a clear interpretation given an added dimension; or
      2. if one configuration is easier to visualize (e.g 3-D vs 4-D solution),
	 - especially in a situation where it is unclear what can be gained in explanatory power by using the extra dimension.
*** asymmetry
    -poor fit can be caused by several factors
*** Exemplars
    - In an MDS analysis of N objects, one of which is an exemplar, the only way to minimize distortion (i.e., stress) is to place the exemplar at the center of the configuration and arrange the other objects around it.
    - [[Samplaski,%202005][samplaski]] note 15
*** INDSCAL
    - deals with idiosyncrasies of subjects ratings
    - takes one matrix per subject
    - [[Samplaski,%202005][samplaski]] paragraph 13
*** ASCAL
     - deals with possible asymmetries underlying the data
     - [[Samplaski,%202005][samplaski]] paragraph 14
*** CA
    - *cluster analysis*
    - (Tversky, 1977; Tversky and Gati, 1982; Tversky and Hutchinson, 1986)
    - helps with problem of highly seperable dimensions
    - There is a family of CA models, but they all work similarly: given a proximity or distance matrix, some method is used to pick the pair of objects most like each other, group them into a single cluster, and derive a new reduced matrix. When the process is finished, the objects will be grouped into a binary tree structure (exactly two branches descend from each node, and the objects are "leaves" at the termini of the final branches), where the distance between any pair of objects is related to the length of the path along the branches separating them.
*** PMDS
    - *Probabalistic MDS*
    - [[Samplaski,%202005][Samplaski]] paragraph 23
    - assumed there is euclidean space
    - onjects are probability distributions
    - variance
    - PMDS is a technique still under development (2005)
    - [[PROSCAL]]
