doc.html

<div id="outline-container-20-6" class="outline-4">
<h4 id="sec-20-6"><span class="section-number-4">20.6</span> dimensionality</h4>
<div class="outline-text-4" id="text-20-6">

<ul>
<li>choose dimensionality on the bases of clarity and logical interpretation.
</li>
<li>one dimension above or below "optimal" as indicated by the stress/r2 values might be better:
<ol>
<li>if there is a clear interpretation given an added dimension; or
</li>
<li>if one configuration is easier to visualize (e.g 3-D vs 4-D solution),
<ul>
<li>especially in a situation where it is unclear what can be gained in explanatory power by using the extra dimension.
</li>
</ul>

</li>
</ol>

</li>
</ul>

</div>

</div>

<div id="outline-container-20-7" class="outline-4">
<h4 id="sec-20-7"><span class="section-number-4">20.7</span> asymmetry</h4>
<div class="outline-text-4" id="text-20-7">

<p>    -poor fit can be caused by several factors
</p></div>

</div>

<div id="outline-container-20-8" class="outline-4">
<h4 id="sec-20-8"><span class="section-number-4">20.8</span> Exemplars</h4>
<div class="outline-text-4" id="text-20-8">

<ul>
<li>In an MDS analysis of N objects, one of which is an exemplar, the only way to minimize distortion (i.e., stress) is to place the exemplar at the center of the configuration and arrange the other objects around it.
</li>
<li><a href="#sec-13">samplaski</a> note 15
</li>
</ul>

</div>

</div>

<div id="outline-container-20-9" class="outline-4">
<h4 id="sec-20-9"><span class="section-number-4">20.9</span> INDSCAL</h4>
<div class="outline-text-4" id="text-20-9">

<ul>
<li>deals with idiosyncrasies of subjects ratings
</li>
<li>takes one matrix per subject
</li>
<li><a href="#sec-13">samplaski</a> paragraph 13
</li>
</ul>

</div>

</div>

<div id="outline-container-20-10" class="outline-4">
<h4 id="sec-20-10"><span class="section-number-4">20.10</span> ASCAL</h4>
<div class="outline-text-4" id="text-20-10">

<ul>
<li>deals with possible asymmetries underlying the data
</li>
<li><a href="#sec-13">samplaski</a> paragraph 14
</li>
</ul>

</div>

</div>

<div id="outline-container-20-11" class="outline-4">
<h4 id="sec-20-11"><span class="section-number-4">20.11</span> CA</h4>
<div class="outline-text-4" id="text-20-11">

<ul>
<li><b>cluster analysis</b>
</li>
<li>(Tversky, 1977; Tversky and Gati, 1982; Tversky and Hutchinson, 1986)
</li>
<li>helps with problem of highly seperable dimensions
</li>
<li>There is a family of CA models, but they all work similarly: given a proximity or distance matrix, some method is used to pick the pair of objects most like each other, group them into a single cluster, and derive a new reduced matrix. When the process is finished, the objects will be grouped into a binary tree structure (exactly two branches descend from each node, and the objects are "leaves" at the termini of the final branches), where the distance between any pair of objects is related to the length of the path along the branches separating them.
</li>
</ul>

</div>

</div>

<div id="outline-container-20-12" class="outline-4">
<h4 id="sec-20-12"><span class="section-number-4">20.12</span> PMDS</h4>
<div class="outline-text-4" id="text-20-12">

<ul>
<li><b>Probabalistic MDS</b>
</li>
<li><a href="#sec-13">Samplaski</a> paragraph 23
</li>
<li>assumed there is euclidean space
</li>
<li>onjects are probability distributions
</li>
<li>variance
</li>
<li>PMDS is a technique still under development (2005)
</li>
<li><a href="#PROSCAL">PROSCAL</a>
</li>
</ul>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-01-30T09:55+0100</p>
<p class="author">Author: NICHOLAS HARLEY</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
