doc.tex

\subsection{dimensionality}
\label{sec-22-6}
\begin{itemize}
\item choose dimensionality on the bases of clarity and logical
interpretation.
\item one dimension above or below "optimal" as indicated by the
stress/r2 values might be better:
\begin{enumerate}
\item if there is a clear interpretation given an added dimension; or
\item if one configuration is easier to visualize (e.g 3-D vs 4-D
solution),
\begin{itemize}
\item especially in a situation where it is unclear what can be
gained in explanatory power by using the extra dimension.
\end{itemize}
\end{enumerate}
\end{itemize}

\subsection{asymmetry}
\label{sec-22-7}
-poor fit can be caused by several factors

\subsection{Exemplars}
\label{sec-22-8}
\begin{itemize}
\item In an MDS analysis of N objects, one of which is an exemplar,
the only way to minimize distortion (i.e., stress) is to place
the exemplar at the center of the configuration and arrange the
other objects around it.
\item \texttt{samplaski} note 15
\end{itemize}

\subsection{INDSCAL}
\label{sec-22-9}
\begin{itemize}
\item deals with idiosyncrasies of subjects ratings
\item takes one matrix per subject
\item \texttt{samplaski} paragraph 13
\end{itemize}

\subsection{ASCAL}
\label{sec-22-10}
\begin{itemize}
\item deals with possible asymmetries underlying the data
\item \texttt{samplaski} paragraph 14
\end{itemize}

\subsection{CA}
\label{sec-22-11}
\begin{itemize}
\item \textbf{cluster analysis}
\item (Tversky, 1977; Tversky and Gati, 1982; Tversky and
Hutchinson, 1986)
\item helps with problem of highly seperable dimensions
\item There is a family of CA models, but they all work similarly:
given a proximity or distance matrix, some method is used to
pick the pair of objects most like each other, group them into a
single cluster, and derive a new reduced matrix. When the
process is finished, the objects will be grouped into a binary
tree structure (exactly two branches descend from each node, and
the objects are "leaves" at the termini of the final branches),
where the distance between any pair of objects is related to the
length of the path along the branches separating them.
\end{itemize}

\subsection{PMDS}
\label{sec-22-12}
\begin{itemize}
\item \textbf{Probabalistic MDS}
\item \texttt{Samplaski} paragraph 23
\item assumed there is euclidean space
\item onjects are probability distributions
\item variance
\item PMDS is a technique still under development (2005)
\item \texttt{PROSCAL}
\end{itemize}
% Emacs 24.3.1 (Org mode 8.2.5g)
\end{document}
